Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xe5a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3589c): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xb49ab): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xc7fe9): C:/Users/Lenovo/STM32CubeIDE/RTOS_Workspace/001_Tasks/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 8 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x65a47): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x3b63e): __uint8_t
    <36>   DW_AT_decl_file   : 4
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 8 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xc3a5a): unsigned char
 <1><44>: Abbrev Number: 8 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x96f0a): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xa5526): __uint16_t
    <50>   DW_AT_decl_file   : 4
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 8 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xc2272): short unsigned int
 <1><5e>: Abbrev Number: 8 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x10ace): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x811de): __uint32_t
    <6a>   DW_AT_decl_file   : 4
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 8 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4dd7d): long unsigned int
 <1><78>: Abbrev Number: 8 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x5caa8): long long int
 <1><7f>: Abbrev Number: 8 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x2ab50): long long unsigned int
 <1><86>: Abbrev Number: 30 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 8 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x1017b): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x3b640): uint8_t
    <99>   DW_AT_decl_file   : 5
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x93bc6): uint16_t
    <a5>   DW_AT_decl_file   : 5
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 15 (DW_TAG_const_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 4 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0xaa4e8): uint32_t
    <b6>   DW_AT_decl_file   : 5
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 16 (DW_TAG_array_type)
    <c3>   DW_AT_type        : <0xb1>
    <c7>   DW_AT_sibling     : <0xd2>
 <2><cb>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <cc>   DW_AT_type        : <0x8d>
    <d0>   DW_AT_upper_bound : 1
 <2><d1>: Abbrev Number: 0
 <1><d2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <d3>   DW_AT_byte_size   : 24
    <d4>   DW_AT_decl_file   : 6
    <d5>   DW_AT_decl_line   : 345
    <d7>   DW_AT_decl_column : 9
    <d7>   DW_AT_sibling     : <0x129>
 <2><db>: Abbrev Number: 5 (DW_TAG_member)
    <dc>   DW_AT_name        : CR
    <df>   DW_AT_decl_file   : 6
    <df>   DW_AT_decl_line   : 347
    <e1>   DW_AT_decl_column : 17
    <e1>   DW_AT_type        : <0xbd>
    <e5>   DW_AT_data_member_location: 0
 <2><e6>: Abbrev Number: 1 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x4d5ef): NDTR
    <eb>   DW_AT_decl_file   : 6
    <ec>   DW_AT_decl_line   : 348
    <ee>   DW_AT_decl_column : 17
    <ef>   DW_AT_type        : <0xbd>
    <f3>   DW_AT_data_member_location: 4
 <2><f4>: Abbrev Number: 5 (DW_TAG_member)
    <f5>   DW_AT_name        : PAR
    <f9>   DW_AT_decl_file   : 6
    <f9>   DW_AT_decl_line   : 349
    <fb>   DW_AT_decl_column : 17
    <fb>   DW_AT_type        : <0xbd>
    <ff>   DW_AT_data_member_location: 8
 <2><100>: Abbrev Number: 1 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0x545a5): M0AR
    <105>   DW_AT_decl_file   : 6
    <106>   DW_AT_decl_line   : 350
    <108>   DW_AT_decl_column : 17
    <109>   DW_AT_type        : <0xbd>
    <10d>   DW_AT_data_member_location: 12
 <2><10e>: Abbrev Number: 1 (DW_TAG_member)
    <10f>   DW_AT_name        : (indirect string, offset: 0x706b1): M1AR
    <113>   DW_AT_decl_file   : 6
    <114>   DW_AT_decl_line   : 351
    <116>   DW_AT_decl_column : 17
    <117>   DW_AT_type        : <0xbd>
    <11b>   DW_AT_data_member_location: 16
 <2><11c>: Abbrev Number: 5 (DW_TAG_member)
    <11d>   DW_AT_name        : FCR
    <121>   DW_AT_decl_file   : 6
    <121>   DW_AT_decl_line   : 352
    <123>   DW_AT_decl_column : 17
    <123>   DW_AT_type        : <0xbd>
    <127>   DW_AT_data_member_location: 20
 <2><128>: Abbrev Number: 0
 <1><129>: Abbrev Number: 10 (DW_TAG_typedef)
    <12a>   DW_AT_name        : (indirect string, offset: 0xb80d1): DMA_Stream_TypeDef
    <12e>   DW_AT_decl_file   : 6
    <12f>   DW_AT_decl_line   : 353
    <131>   DW_AT_decl_column : 3
    <131>   DW_AT_type        : <0xd2>
 <1><135>: Abbrev Number: 12 (DW_TAG_structure_type)
    <136>   DW_AT_byte_size   : 40
    <137>   DW_AT_decl_file   : 6
    <138>   DW_AT_decl_line   : 526
    <13a>   DW_AT_decl_column : 9
    <13a>   DW_AT_sibling     : <0x1b7>
 <2><13e>: Abbrev Number: 1 (DW_TAG_member)
    <13f>   DW_AT_name        : (indirect string, offset: 0x83bf7): MODER
    <143>   DW_AT_decl_file   : 6
    <144>   DW_AT_decl_line   : 528
    <146>   DW_AT_decl_column : 17
    <147>   DW_AT_type        : <0xbd>
    <14b>   DW_AT_data_member_location: 0
 <2><14c>: Abbrev Number: 1 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x9cca4): OTYPER
    <151>   DW_AT_decl_file   : 6
    <152>   DW_AT_decl_line   : 529
    <154>   DW_AT_decl_column : 17
    <155>   DW_AT_type        : <0xbd>
    <159>   DW_AT_data_member_location: 4
 <2><15a>: Abbrev Number: 1 (DW_TAG_member)
    <15b>   DW_AT_name        : (indirect string, offset: 0xb0313): OSPEEDR
    <15f>   DW_AT_decl_file   : 6
    <160>   DW_AT_decl_line   : 530
    <162>   DW_AT_decl_column : 17
    <163>   DW_AT_type        : <0xbd>
    <167>   DW_AT_data_member_location: 8
 <2><168>: Abbrev Number: 1 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x75764): PUPDR
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 531
    <170>   DW_AT_decl_column : 17
    <171>   DW_AT_type        : <0xbd>
    <175>   DW_AT_data_member_location: 12
 <2><176>: Abbrev Number: 5 (DW_TAG_member)
    <177>   DW_AT_name        : IDR
    <17b>   DW_AT_decl_file   : 6
    <17b>   DW_AT_decl_line   : 532
    <17d>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xbd>
    <181>   DW_AT_data_member_location: 16
 <2><182>: Abbrev Number: 5 (DW_TAG_member)
    <183>   DW_AT_name        : ODR
    <187>   DW_AT_decl_file   : 6
    <187>   DW_AT_decl_line   : 533
    <189>   DW_AT_decl_column : 17
    <189>   DW_AT_type        : <0xbd>
    <18d>   DW_AT_data_member_location: 20
 <2><18e>: Abbrev Number: 1 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x2e290): BSRR
    <193>   DW_AT_decl_file   : 6
    <194>   DW_AT_decl_line   : 534
    <196>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xbd>
    <19b>   DW_AT_data_member_location: 24
 <2><19c>: Abbrev Number: 1 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0xada65): LCKR
    <1a1>   DW_AT_decl_file   : 6
    <1a2>   DW_AT_decl_line   : 535
    <1a4>   DW_AT_decl_column : 17
    <1a5>   DW_AT_type        : <0xbd>
    <1a9>   DW_AT_data_member_location: 28
 <2><1aa>: Abbrev Number: 5 (DW_TAG_member)
    <1ab>   DW_AT_name        : AFR
    <1af>   DW_AT_decl_file   : 6
    <1af>   DW_AT_decl_line   : 536
    <1b1>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0x1c7>
    <1b5>   DW_AT_data_member_location: 32
 <2><1b6>: Abbrev Number: 0
 <1><1b7>: Abbrev Number: 16 (DW_TAG_array_type)
    <1b8>   DW_AT_type        : <0xbd>
    <1bc>   DW_AT_sibling     : <0x1c7>
 <2><1c0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1c1>   DW_AT_type        : <0x8d>
    <1c5>   DW_AT_upper_bound : 1
 <2><1c6>: Abbrev Number: 0
 <1><1c7>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <1c8>   DW_AT_type        : <0x1b7>
 <1><1cc>: Abbrev Number: 10 (DW_TAG_typedef)
    <1cd>   DW_AT_name        : (indirect string, offset: 0xc4c06): GPIO_TypeDef
    <1d1>   DW_AT_decl_file   : 6
    <1d2>   DW_AT_decl_line   : 537
    <1d4>   DW_AT_decl_column : 3
    <1d4>   DW_AT_type        : <0x135>
 <1><1d8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1d9>   DW_AT_byte_size   : 8
    <1da>   DW_AT_decl_file   : 6
    <1db>   DW_AT_decl_line   : 586
    <1dd>   DW_AT_decl_column : 9
    <1dd>   DW_AT_sibling     : <0x1f9>
 <2><1e1>: Abbrev Number: 5 (DW_TAG_member)
    <1e2>   DW_AT_name        : CR
    <1e5>   DW_AT_decl_file   : 6
    <1e5>   DW_AT_decl_line   : 588
    <1e7>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xbd>
    <1eb>   DW_AT_data_member_location: 0
 <2><1ec>: Abbrev Number: 5 (DW_TAG_member)
    <1ed>   DW_AT_name        : CSR
    <1f1>   DW_AT_decl_file   : 6
    <1f1>   DW_AT_decl_line   : 589
    <1f3>   DW_AT_decl_column : 17
    <1f3>   DW_AT_type        : <0xbd>
    <1f7>   DW_AT_data_member_location: 4
 <2><1f8>: Abbrev Number: 0
 <1><1f9>: Abbrev Number: 10 (DW_TAG_typedef)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x925b5): PWR_TypeDef
    <1fe>   DW_AT_decl_file   : 6
    <1ff>   DW_AT_decl_line   : 590
    <201>   DW_AT_decl_column : 3
    <201>   DW_AT_type        : <0x1d8>
 <1><205>: Abbrev Number: 12 (DW_TAG_structure_type)
    <206>   DW_AT_byte_size   : 136
    <207>   DW_AT_decl_file   : 6
    <208>   DW_AT_decl_line   : 596
    <20a>   DW_AT_decl_column : 9
    <20a>   DW_AT_sibling     : <0x3ac>
 <2><20e>: Abbrev Number: 5 (DW_TAG_member)
    <20f>   DW_AT_name        : CR
    <212>   DW_AT_decl_file   : 6
    <212>   DW_AT_decl_line   : 598
    <214>   DW_AT_decl_column : 17
    <214>   DW_AT_type        : <0xbd>
    <218>   DW_AT_data_member_location: 0
 <2><219>: Abbrev Number: 1 (DW_TAG_member)
    <21a>   DW_AT_name        : (indirect string, offset: 0x8da35): PLLCFGR
    <21e>   DW_AT_decl_file   : 6
    <21f>   DW_AT_decl_line   : 599
    <221>   DW_AT_decl_column : 17
    <222>   DW_AT_type        : <0xbd>
    <226>   DW_AT_data_member_location: 4
 <2><227>: Abbrev Number: 1 (DW_TAG_member)
    <228>   DW_AT_name        : (indirect string, offset: 0x8da38): CFGR
    <22c>   DW_AT_decl_file   : 6
    <22d>   DW_AT_decl_line   : 600
    <22f>   DW_AT_decl_column : 17
    <230>   DW_AT_type        : <0xbd>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 5 (DW_TAG_member)
    <236>   DW_AT_name        : CIR
    <23a>   DW_AT_decl_file   : 6
    <23a>   DW_AT_decl_line   : 601
    <23c>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xbd>
    <240>   DW_AT_data_member_location: 12
 <2><241>: Abbrev Number: 1 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0xa13e8): AHB1RSTR
    <246>   DW_AT_decl_file   : 6
    <247>   DW_AT_decl_line   : 602
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0xbd>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 1 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x169d5): AHB2RSTR
    <254>   DW_AT_decl_file   : 6
    <255>   DW_AT_decl_line   : 603
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xbd>
    <25c>   DW_AT_data_member_location: 20
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x432fb): AHB3RSTR
    <262>   DW_AT_decl_file   : 6
    <263>   DW_AT_decl_line   : 604
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0xbd>
    <26a>   DW_AT_data_member_location: 24
 <2><26b>: Abbrev Number: 1 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0xbf1b3): RESERVED0
    <270>   DW_AT_decl_file   : 6
    <271>   DW_AT_decl_line   : 605
    <273>   DW_AT_decl_column : 17
    <274>   DW_AT_type        : <0xb1>
    <278>   DW_AT_data_member_location: 28
 <2><279>: Abbrev Number: 1 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0x1654e): APB1RSTR
    <27e>   DW_AT_decl_file   : 6
    <27f>   DW_AT_decl_line   : 606
    <281>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0xbd>
    <286>   DW_AT_data_member_location: 32
 <2><287>: Abbrev Number: 1 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0x57e52): APB2RSTR
    <28c>   DW_AT_decl_file   : 6
    <28d>   DW_AT_decl_line   : 607
    <28f>   DW_AT_decl_column : 17
    <290>   DW_AT_type        : <0xbd>
    <294>   DW_AT_data_member_location: 36
 <2><295>: Abbrev Number: 1 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0xbf1bd): RESERVED1
    <29a>   DW_AT_decl_file   : 6
    <29b>   DW_AT_decl_line   : 608
    <29d>   DW_AT_decl_column : 17
    <29e>   DW_AT_type        : <0xc2>
    <2a2>   DW_AT_data_member_location: 40
 <2><2a3>: Abbrev Number: 1 (DW_TAG_member)
    <2a4>   DW_AT_name        : (indirect string, offset: 0x10110): AHB1ENR
    <2a8>   DW_AT_decl_file   : 6
    <2a9>   DW_AT_decl_line   : 609
    <2ab>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xbd>
    <2b0>   DW_AT_data_member_location: 48
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x36475): AHB2ENR
    <2b6>   DW_AT_decl_file   : 6
    <2b7>   DW_AT_decl_line   : 610
    <2b9>   DW_AT_decl_column : 17
    <2ba>   DW_AT_type        : <0xbd>
    <2be>   DW_AT_data_member_location: 52
 <2><2bf>: Abbrev Number: 1 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x5b04e): AHB3ENR
    <2c4>   DW_AT_decl_file   : 6
    <2c5>   DW_AT_decl_line   : 611
    <2c7>   DW_AT_decl_column : 17
    <2c8>   DW_AT_type        : <0xbd>
    <2cc>   DW_AT_data_member_location: 56
 <2><2cd>: Abbrev Number: 1 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0xbf1c7): RESERVED2
    <2d2>   DW_AT_decl_file   : 6
    <2d3>   DW_AT_decl_line   : 612
    <2d5>   DW_AT_decl_column : 17
    <2d6>   DW_AT_type        : <0xb1>
    <2da>   DW_AT_data_member_location: 60
 <2><2db>: Abbrev Number: 1 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x74846): APB1ENR
    <2e0>   DW_AT_decl_file   : 6
    <2e1>   DW_AT_decl_line   : 613
    <2e3>   DW_AT_decl_column : 17
    <2e4>   DW_AT_type        : <0xbd>
    <2e8>   DW_AT_data_member_location: 64
 <2><2e9>: Abbrev Number: 1 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indirect string, offset: 0x17b6d): APB2ENR
    <2ee>   DW_AT_decl_file   : 6
    <2ef>   DW_AT_decl_line   : 614
    <2f1>   DW_AT_decl_column : 17
    <2f2>   DW_AT_type        : <0xbd>
    <2f6>   DW_AT_data_member_location: 68
 <2><2f7>: Abbrev Number: 1 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0xbf1d1): RESERVED3
    <2fc>   DW_AT_decl_file   : 6
    <2fd>   DW_AT_decl_line   : 615
    <2ff>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0xc2>
    <304>   DW_AT_data_member_location: 72
 <2><305>: Abbrev Number: 1 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xa53ab): AHB1LPENR
    <30a>   DW_AT_decl_file   : 6
    <30b>   DW_AT_decl_line   : 616
    <30d>   DW_AT_decl_column : 17
    <30e>   DW_AT_type        : <0xbd>
    <312>   DW_AT_data_member_location: 80
 <2><313>: Abbrev Number: 1 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0x2dee1): AHB2LPENR
    <318>   DW_AT_decl_file   : 6
    <319>   DW_AT_decl_line   : 617
    <31b>   DW_AT_decl_column : 17
    <31c>   DW_AT_type        : <0xbd>
    <320>   DW_AT_data_member_location: 84
 <2><321>: Abbrev Number: 1 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x88c9c): AHB3LPENR
    <326>   DW_AT_decl_file   : 6
    <327>   DW_AT_decl_line   : 618
    <329>   DW_AT_decl_column : 17
    <32a>   DW_AT_type        : <0xbd>
    <32e>   DW_AT_data_member_location: 88
 <2><32f>: Abbrev Number: 1 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0xbf1db): RESERVED4
    <334>   DW_AT_decl_file   : 6
    <335>   DW_AT_decl_line   : 619
    <337>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0xb1>
    <33c>   DW_AT_data_member_location: 92
 <2><33d>: Abbrev Number: 1 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0xaa12b): APB1LPENR
    <342>   DW_AT_decl_file   : 6
    <343>   DW_AT_decl_line   : 620
    <345>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0xbd>
    <34a>   DW_AT_data_member_location: 96
 <2><34b>: Abbrev Number: 1 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0x33de9): APB2LPENR
    <350>   DW_AT_decl_file   : 6
    <351>   DW_AT_decl_line   : 621
    <353>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xbd>
    <358>   DW_AT_data_member_location: 100
 <2><359>: Abbrev Number: 1 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xbf1e5): RESERVED5
    <35e>   DW_AT_decl_file   : 6
    <35f>   DW_AT_decl_line   : 622
    <361>   DW_AT_decl_column : 17
    <362>   DW_AT_type        : <0xc2>
    <366>   DW_AT_data_member_location: 104
 <2><367>: Abbrev Number: 1 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x1c19a): BDCR
    <36c>   DW_AT_decl_file   : 6
    <36d>   DW_AT_decl_line   : 623
    <36f>   DW_AT_decl_column : 17
    <370>   DW_AT_type        : <0xbd>
    <374>   DW_AT_data_member_location: 112
 <2><375>: Abbrev Number: 5 (DW_TAG_member)
    <376>   DW_AT_name        : CSR
    <37a>   DW_AT_decl_file   : 6
    <37a>   DW_AT_decl_line   : 624
    <37c>   DW_AT_decl_column : 17
    <37c>   DW_AT_type        : <0xbd>
    <380>   DW_AT_data_member_location: 116
 <2><381>: Abbrev Number: 1 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0x78ffc): RESERVED6
    <386>   DW_AT_decl_file   : 6
    <387>   DW_AT_decl_line   : 625
    <389>   DW_AT_decl_column : 17
    <38a>   DW_AT_type        : <0xc2>
    <38e>   DW_AT_data_member_location: 120
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x6bafe): SSCGR
    <394>   DW_AT_decl_file   : 6
    <395>   DW_AT_decl_line   : 626
    <397>   DW_AT_decl_column : 17
    <398>   DW_AT_type        : <0xbd>
    <39c>   DW_AT_data_member_location: 128
 <2><39d>: Abbrev Number: 1 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x43c94): PLLI2SCFGR
    <3a2>   DW_AT_decl_file   : 6
    <3a3>   DW_AT_decl_line   : 627
    <3a5>   DW_AT_decl_column : 17
    <3a6>   DW_AT_type        : <0xbd>
    <3aa>   DW_AT_data_member_location: 132
 <2><3ab>: Abbrev Number: 0
 <1><3ac>: Abbrev Number: 10 (DW_TAG_typedef)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x5df6a): RCC_TypeDef
    <3b1>   DW_AT_decl_file   : 6
    <3b2>   DW_AT_decl_line   : 628
    <3b4>   DW_AT_decl_column : 3
    <3b4>   DW_AT_type        : <0x205>
 <1><3b8>: Abbrev Number: 12 (DW_TAG_structure_type)
    <3b9>   DW_AT_byte_size   : 84
    <3ba>   DW_AT_decl_file   : 6
    <3bb>   DW_AT_decl_line   : 728
    <3bd>   DW_AT_decl_column : 9
    <3bd>   DW_AT_sibling     : <0x4d2>
 <2><3c1>: Abbrev Number: 5 (DW_TAG_member)
    <3c2>   DW_AT_name        : CR1
    <3c6>   DW_AT_decl_file   : 6
    <3c6>   DW_AT_decl_line   : 730
    <3c8>   DW_AT_decl_column : 17
    <3c8>   DW_AT_type        : <0xbd>
    <3cc>   DW_AT_data_member_location: 0
 <2><3cd>: Abbrev Number: 5 (DW_TAG_member)
    <3ce>   DW_AT_name        : CR2
    <3d2>   DW_AT_decl_file   : 6
    <3d2>   DW_AT_decl_line   : 731
    <3d4>   DW_AT_decl_column : 17
    <3d4>   DW_AT_type        : <0xbd>
    <3d8>   DW_AT_data_member_location: 4
 <2><3d9>: Abbrev Number: 1 (DW_TAG_member)
    <3da>   DW_AT_name        : (indirect string, offset: 0x3be2d): SMCR
    <3de>   DW_AT_decl_file   : 6
    <3df>   DW_AT_decl_line   : 732
    <3e1>   DW_AT_decl_column : 17
    <3e2>   DW_AT_type        : <0xbd>
    <3e6>   DW_AT_data_member_location: 8
 <2><3e7>: Abbrev Number: 1 (DW_TAG_member)
    <3e8>   DW_AT_name        : (indirect string, offset: 0x4229d): DIER
    <3ec>   DW_AT_decl_file   : 6
    <3ed>   DW_AT_decl_line   : 733
    <3ef>   DW_AT_decl_column : 17
    <3f0>   DW_AT_type        : <0xbd>
    <3f4>   DW_AT_data_member_location: 12
 <2><3f5>: Abbrev Number: 5 (DW_TAG_member)
    <3f6>   DW_AT_name        : SR
    <3f9>   DW_AT_decl_file   : 6
    <3f9>   DW_AT_decl_line   : 734
    <3fb>   DW_AT_decl_column : 17
    <3fb>   DW_AT_type        : <0xbd>
    <3ff>   DW_AT_data_member_location: 16
 <2><400>: Abbrev Number: 5 (DW_TAG_member)
    <401>   DW_AT_name        : EGR
    <405>   DW_AT_decl_file   : 6
    <405>   DW_AT_decl_line   : 735
    <407>   DW_AT_decl_column : 17
    <407>   DW_AT_type        : <0xbd>
    <40b>   DW_AT_data_member_location: 20
 <2><40c>: Abbrev Number: 1 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0xb8e58): CCMR1
    <411>   DW_AT_decl_file   : 6
    <412>   DW_AT_decl_line   : 736
    <414>   DW_AT_decl_column : 17
    <415>   DW_AT_type        : <0xbd>
    <419>   DW_AT_data_member_location: 24
 <2><41a>: Abbrev Number: 1 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x512cb): CCMR2
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 737
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0xbd>
    <427>   DW_AT_data_member_location: 28
 <2><428>: Abbrev Number: 1 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x31c3b): CCER
    <42d>   DW_AT_decl_file   : 6
    <42e>   DW_AT_decl_line   : 738
    <430>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0xbd>
    <435>   DW_AT_data_member_location: 32
 <2><436>: Abbrev Number: 5 (DW_TAG_member)
    <437>   DW_AT_name        : CNT
    <43b>   DW_AT_decl_file   : 6
    <43b>   DW_AT_decl_line   : 739
    <43d>   DW_AT_decl_column : 17
    <43d>   DW_AT_type        : <0xbd>
    <441>   DW_AT_data_member_location: 36
 <2><442>: Abbrev Number: 5 (DW_TAG_member)
    <443>   DW_AT_name        : PSC
    <447>   DW_AT_decl_file   : 6
    <447>   DW_AT_decl_line   : 740
    <449>   DW_AT_decl_column : 17
    <449>   DW_AT_type        : <0xbd>
    <44d>   DW_AT_data_member_location: 40
 <2><44e>: Abbrev Number: 5 (DW_TAG_member)
    <44f>   DW_AT_name        : ARR
    <453>   DW_AT_decl_file   : 6
    <453>   DW_AT_decl_line   : 741
    <455>   DW_AT_decl_column : 17
    <455>   DW_AT_type        : <0xbd>
    <459>   DW_AT_data_member_location: 44
 <2><45a>: Abbrev Number: 5 (DW_TAG_member)
    <45b>   DW_AT_name        : RCR
    <45f>   DW_AT_decl_file   : 6
    <45f>   DW_AT_decl_line   : 742
    <461>   DW_AT_decl_column : 17
    <461>   DW_AT_type        : <0xbd>
    <465>   DW_AT_data_member_location: 48
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x17b68): CCR1
    <46b>   DW_AT_decl_file   : 6
    <46c>   DW_AT_decl_line   : 743
    <46e>   DW_AT_decl_column : 17
    <46f>   DW_AT_type        : <0xbd>
    <473>   DW_AT_data_member_location: 52
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x55182): CCR2
    <479>   DW_AT_decl_file   : 6
    <47a>   DW_AT_decl_line   : 744
    <47c>   DW_AT_decl_column : 17
    <47d>   DW_AT_type        : <0xbd>
    <481>   DW_AT_data_member_location: 56
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x9ac30): CCR3
    <487>   DW_AT_decl_file   : 6
    <488>   DW_AT_decl_line   : 745
    <48a>   DW_AT_decl_column : 17
    <48b>   DW_AT_type        : <0xbd>
    <48f>   DW_AT_data_member_location: 60
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0xc68f): CCR4
    <495>   DW_AT_decl_file   : 6
    <496>   DW_AT_decl_line   : 746
    <498>   DW_AT_decl_column : 17
    <499>   DW_AT_type        : <0xbd>
    <49d>   DW_AT_data_member_location: 64
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x8a0a5): BDTR
    <4a3>   DW_AT_decl_file   : 6
    <4a4>   DW_AT_decl_line   : 747
    <4a6>   DW_AT_decl_column : 17
    <4a7>   DW_AT_type        : <0xbd>
    <4ab>   DW_AT_data_member_location: 68
 <2><4ac>: Abbrev Number: 5 (DW_TAG_member)
    <4ad>   DW_AT_name        : DCR
    <4b1>   DW_AT_decl_file   : 6
    <4b1>   DW_AT_decl_line   : 748
    <4b3>   DW_AT_decl_column : 17
    <4b3>   DW_AT_type        : <0xbd>
    <4b7>   DW_AT_data_member_location: 72
 <2><4b8>: Abbrev Number: 1 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0xae099): DMAR
    <4bd>   DW_AT_decl_file   : 6
    <4be>   DW_AT_decl_line   : 749
    <4c0>   DW_AT_decl_column : 17
    <4c1>   DW_AT_type        : <0xbd>
    <4c5>   DW_AT_data_member_location: 76
 <2><4c6>: Abbrev Number: 5 (DW_TAG_member)
    <4c7>   DW_AT_name        : OR
    <4ca>   DW_AT_decl_file   : 6
    <4ca>   DW_AT_decl_line   : 750
    <4cc>   DW_AT_decl_column : 17
    <4cc>   DW_AT_type        : <0xbd>
    <4d0>   DW_AT_data_member_location: 80
 <2><4d1>: Abbrev Number: 0
 <1><4d2>: Abbrev Number: 10 (DW_TAG_typedef)
    <4d3>   DW_AT_name        : (indirect string, offset: 0xbfd55): TIM_TypeDef
    <4d7>   DW_AT_decl_file   : 6
    <4d8>   DW_AT_decl_line   : 751
    <4da>   DW_AT_decl_column : 3
    <4da>   DW_AT_type        : <0x3b8>
 <1><4de>: Abbrev Number: 8 (DW_TAG_base_type)
    <4df>   DW_AT_byte_size   : 8
    <4e0>   DW_AT_encoding    : 4	(float)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x1237e): long double
 <1><4e5>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <4e6>   DW_AT_encoding    : 7	(unsigned)
    <4e6>   DW_AT_byte_size   : 1
    <4e6>   DW_AT_type        : <0x3d>
    <4ea>   DW_AT_decl_file   : 7
    <4eb>   DW_AT_decl_line   : 39
    <4ec>   DW_AT_decl_column : 1
    <4ec>   DW_AT_sibling     : <0x509>
 <2><4f0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x44d73): HAL_OK
    <4f5>   DW_AT_const_value : 0
 <2><4f6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x7eed7): HAL_ERROR
    <4fb>   DW_AT_const_value : 1
 <2><4fc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x23d35): HAL_BUSY
    <501>   DW_AT_const_value : 2
 <2><502>: Abbrev Number: 3 (DW_TAG_enumerator)
    <503>   DW_AT_name        : (indirect string, offset: 0x3bd2f): HAL_TIMEOUT
    <507>   DW_AT_const_value : 3
 <2><508>: Abbrev Number: 0
 <1><509>: Abbrev Number: 4 (DW_TAG_typedef)
    <50a>   DW_AT_name        : (indirect string, offset: 0x245d): HAL_StatusTypeDef
    <50e>   DW_AT_decl_file   : 7
    <50f>   DW_AT_decl_line   : 44
    <510>   DW_AT_decl_column : 3
    <511>   DW_AT_type        : <0x4e5>
 <1><515>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <516>   DW_AT_encoding    : 7	(unsigned)
    <516>   DW_AT_byte_size   : 1
    <516>   DW_AT_type        : <0x3d>
    <51a>   DW_AT_decl_file   : 7
    <51b>   DW_AT_decl_line   : 50
    <51c>   DW_AT_decl_column : 1
    <51c>   DW_AT_sibling     : <0x52d>
 <2><520>: Abbrev Number: 3 (DW_TAG_enumerator)
    <521>   DW_AT_name        : (indirect string, offset: 0x95c06): HAL_UNLOCKED
    <525>   DW_AT_const_value : 0
 <2><526>: Abbrev Number: 3 (DW_TAG_enumerator)
    <527>   DW_AT_name        : (indirect string, offset: 0xca420): HAL_LOCKED
    <52b>   DW_AT_const_value : 1
 <2><52c>: Abbrev Number: 0
 <1><52d>: Abbrev Number: 4 (DW_TAG_typedef)
    <52e>   DW_AT_name        : (indirect string, offset: 0x77f93): HAL_LockTypeDef
    <532>   DW_AT_decl_file   : 7
    <533>   DW_AT_decl_line   : 53
    <534>   DW_AT_decl_column : 3
    <535>   DW_AT_type        : <0x515>
 <1><539>: Abbrev Number: 13 (DW_TAG_structure_type)
    <53a>   DW_AT_byte_size   : 24
    <53b>   DW_AT_decl_file   : 8
    <53c>   DW_AT_decl_line   : 45
    <53d>   DW_AT_decl_column : 9
    <53d>   DW_AT_sibling     : <0x590>
 <2><541>: Abbrev Number: 2 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x87b0e): PLLState
    <546>   DW_AT_decl_file   : 8
    <547>   DW_AT_decl_line   : 47
    <548>   DW_AT_decl_column : 12
    <549>   DW_AT_type        : <0xb1>
    <54d>   DW_AT_data_member_location: 0
 <2><54e>: Abbrev Number: 2 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0x8c607): PLLSource
    <553>   DW_AT_decl_file   : 8
    <554>   DW_AT_decl_line   : 50
    <555>   DW_AT_decl_column : 12
    <556>   DW_AT_type        : <0xb1>
    <55a>   DW_AT_data_member_location: 4
 <2><55b>: Abbrev Number: 2 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0xa7bf2): PLLM
    <560>   DW_AT_decl_file   : 8
    <561>   DW_AT_decl_line   : 53
    <562>   DW_AT_decl_column : 12
    <563>   DW_AT_type        : <0xb1>
    <567>   DW_AT_data_member_location: 8
 <2><568>: Abbrev Number: 2 (DW_TAG_member)
    <569>   DW_AT_name        : (indirect string, offset: 0xa7bf7): PLLN
    <56d>   DW_AT_decl_file   : 8
    <56e>   DW_AT_decl_line   : 56
    <56f>   DW_AT_decl_column : 12
    <570>   DW_AT_type        : <0xb1>
    <574>   DW_AT_data_member_location: 12
 <2><575>: Abbrev Number: 2 (DW_TAG_member)
    <576>   DW_AT_name        : (indirect string, offset: 0xa7c14): PLLP
    <57a>   DW_AT_decl_file   : 8
    <57b>   DW_AT_decl_line   : 60
    <57c>   DW_AT_decl_column : 12
    <57d>   DW_AT_type        : <0xb1>
    <581>   DW_AT_data_member_location: 16
 <2><582>: Abbrev Number: 2 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0x4bc81): PLLQ
    <587>   DW_AT_decl_file   : 8
    <588>   DW_AT_decl_line   : 63
    <589>   DW_AT_decl_column : 12
    <58a>   DW_AT_type        : <0xb1>
    <58e>   DW_AT_data_member_location: 20
 <2><58f>: Abbrev Number: 0
 <1><590>: Abbrev Number: 4 (DW_TAG_typedef)
    <591>   DW_AT_name        : (indirect string, offset: 0x7ad46): RCC_PLLInitTypeDef
    <595>   DW_AT_decl_file   : 8
    <596>   DW_AT_decl_line   : 73
    <597>   DW_AT_decl_column : 3
    <598>   DW_AT_type        : <0x539>
 <1><59c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <59d>   DW_AT_byte_size   : 48
    <59e>   DW_AT_decl_file   : 9
    <59f>   DW_AT_decl_line   : 49
    <5a0>   DW_AT_decl_column : 9
    <5a0>   DW_AT_sibling     : <0x600>
 <2><5a4>: Abbrev Number: 2 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0xa4e04): OscillatorType
    <5a9>   DW_AT_decl_file   : 9
    <5aa>   DW_AT_decl_line   : 51
    <5ab>   DW_AT_decl_column : 12
    <5ac>   DW_AT_type        : <0xb1>
    <5b0>   DW_AT_data_member_location: 0
 <2><5b1>: Abbrev Number: 2 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x8933c): HSEState
    <5b6>   DW_AT_decl_file   : 9
    <5b7>   DW_AT_decl_line   : 54
    <5b8>   DW_AT_decl_column : 12
    <5b9>   DW_AT_type        : <0xb1>
    <5bd>   DW_AT_data_member_location: 4
 <2><5be>: Abbrev Number: 2 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x7f80b): LSEState
    <5c3>   DW_AT_decl_file   : 9
    <5c4>   DW_AT_decl_line   : 57
    <5c5>   DW_AT_decl_column : 12
    <5c6>   DW_AT_type        : <0xb1>
    <5ca>   DW_AT_data_member_location: 8
 <2><5cb>: Abbrev Number: 2 (DW_TAG_member)
    <5cc>   DW_AT_name        : (indirect string, offset: 0x5a75b): HSIState
    <5d0>   DW_AT_decl_file   : 9
    <5d1>   DW_AT_decl_line   : 60
    <5d2>   DW_AT_decl_column : 12
    <5d3>   DW_AT_type        : <0xb1>
    <5d7>   DW_AT_data_member_location: 12
 <2><5d8>: Abbrev Number: 2 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0xae2a1): HSICalibrationValue
    <5dd>   DW_AT_decl_file   : 9
    <5de>   DW_AT_decl_line   : 63
    <5df>   DW_AT_decl_column : 12
    <5e0>   DW_AT_type        : <0xb1>
    <5e4>   DW_AT_data_member_location: 16
 <2><5e5>: Abbrev Number: 2 (DW_TAG_member)
    <5e6>   DW_AT_name        : (indirect string, offset: 0x4760e): LSIState
    <5ea>   DW_AT_decl_file   : 9
    <5eb>   DW_AT_decl_line   : 66
    <5ec>   DW_AT_decl_column : 12
    <5ed>   DW_AT_type        : <0xb1>
    <5f1>   DW_AT_data_member_location: 20
 <2><5f2>: Abbrev Number: 23 (DW_TAG_member)
    <5f3>   DW_AT_name        : PLL
    <5f7>   DW_AT_decl_file   : 9
    <5f8>   DW_AT_decl_line   : 69
    <5f9>   DW_AT_decl_column : 22
    <5fa>   DW_AT_type        : <0x590>
    <5fe>   DW_AT_data_member_location: 24
 <2><5ff>: Abbrev Number: 0
 <1><600>: Abbrev Number: 4 (DW_TAG_typedef)
    <601>   DW_AT_name        : (indirect string, offset: 0x6c0f0): RCC_OscInitTypeDef
    <605>   DW_AT_decl_file   : 9
    <606>   DW_AT_decl_line   : 70
    <607>   DW_AT_decl_column : 3
    <608>   DW_AT_type        : <0x59c>
 <1><60c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <60d>   DW_AT_byte_size   : 20
    <60e>   DW_AT_decl_file   : 9
    <60f>   DW_AT_decl_line   : 75
    <610>   DW_AT_decl_column : 9
    <610>   DW_AT_sibling     : <0x656>
 <2><614>: Abbrev Number: 2 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0x3e85a): ClockType
    <619>   DW_AT_decl_file   : 9
    <61a>   DW_AT_decl_line   : 77
    <61b>   DW_AT_decl_column : 12
    <61c>   DW_AT_type        : <0xb1>
    <620>   DW_AT_data_member_location: 0
 <2><621>: Abbrev Number: 2 (DW_TAG_member)
    <622>   DW_AT_name        : (indirect string, offset: 0x7a7dd): SYSCLKSource
    <626>   DW_AT_decl_file   : 9
    <627>   DW_AT_decl_line   : 80
    <628>   DW_AT_decl_column : 12
    <629>   DW_AT_type        : <0xb1>
    <62d>   DW_AT_data_member_location: 4
 <2><62e>: Abbrev Number: 2 (DW_TAG_member)
    <62f>   DW_AT_name        : (indirect string, offset: 0xa7635): AHBCLKDivider
    <633>   DW_AT_decl_file   : 9
    <634>   DW_AT_decl_line   : 83
    <635>   DW_AT_decl_column : 12
    <636>   DW_AT_type        : <0xb1>
    <63a>   DW_AT_data_member_location: 8
 <2><63b>: Abbrev Number: 2 (DW_TAG_member)
    <63c>   DW_AT_name        : (indirect string, offset: 0x77bc): APB1CLKDivider
    <640>   DW_AT_decl_file   : 9
    <641>   DW_AT_decl_line   : 86
    <642>   DW_AT_decl_column : 12
    <643>   DW_AT_type        : <0xb1>
    <647>   DW_AT_data_member_location: 12
 <2><648>: Abbrev Number: 2 (DW_TAG_member)
    <649>   DW_AT_name        : (indirect string, offset: 0x5d12b): APB2CLKDivider
    <64d>   DW_AT_decl_file   : 9
    <64e>   DW_AT_decl_line   : 89
    <64f>   DW_AT_decl_column : 12
    <650>   DW_AT_type        : <0xb1>
    <654>   DW_AT_data_member_location: 16
 <2><655>: Abbrev Number: 0
 <1><656>: Abbrev Number: 4 (DW_TAG_typedef)
    <657>   DW_AT_name        : (indirect string, offset: 0x8da22): RCC_ClkInitTypeDef
    <65b>   DW_AT_decl_file   : 9
    <65c>   DW_AT_decl_line   : 92
    <65d>   DW_AT_decl_column : 3
    <65e>   DW_AT_type        : <0x60c>
 <1><662>: Abbrev Number: 13 (DW_TAG_structure_type)
    <663>   DW_AT_byte_size   : 20
    <664>   DW_AT_decl_file   : 10
    <665>   DW_AT_decl_line   : 46
    <666>   DW_AT_decl_column : 9
    <666>   DW_AT_sibling     : <0x6ac>
 <2><66a>: Abbrev Number: 23 (DW_TAG_member)
    <66b>   DW_AT_name        : Pin
    <66f>   DW_AT_decl_file   : 10
    <670>   DW_AT_decl_line   : 48
    <671>   DW_AT_decl_column : 12
    <672>   DW_AT_type        : <0xb1>
    <676>   DW_AT_data_member_location: 0
 <2><677>: Abbrev Number: 2 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0xced10): Mode
    <67c>   DW_AT_decl_file   : 10
    <67d>   DW_AT_decl_line   : 51
    <67e>   DW_AT_decl_column : 12
    <67f>   DW_AT_type        : <0xb1>
    <683>   DW_AT_data_member_location: 4
 <2><684>: Abbrev Number: 2 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x68809): Pull
    <689>   DW_AT_decl_file   : 10
    <68a>   DW_AT_decl_line   : 54
    <68b>   DW_AT_decl_column : 12
    <68c>   DW_AT_type        : <0xb1>
    <690>   DW_AT_data_member_location: 8
 <2><691>: Abbrev Number: 2 (DW_TAG_member)
    <692>   DW_AT_name        : (indirect string, offset: 0x77336): Speed
    <696>   DW_AT_decl_file   : 10
    <697>   DW_AT_decl_line   : 57
    <698>   DW_AT_decl_column : 12
    <699>   DW_AT_type        : <0xb1>
    <69d>   DW_AT_data_member_location: 12
 <2><69e>: Abbrev Number: 2 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0x5d0ec): Alternate
    <6a3>   DW_AT_decl_file   : 10
    <6a4>   DW_AT_decl_line   : 60
    <6a5>   DW_AT_decl_column : 12
    <6a6>   DW_AT_type        : <0xb1>
    <6aa>   DW_AT_data_member_location: 16
 <2><6ab>: Abbrev Number: 0
 <1><6ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x9e7f4): GPIO_InitTypeDef
    <6b1>   DW_AT_decl_file   : 10
    <6b2>   DW_AT_decl_line   : 62
    <6b3>   DW_AT_decl_column : 2
    <6b4>   DW_AT_type        : <0x662>
 <1><6b8>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <6b9>   DW_AT_encoding    : 7	(unsigned)
    <6b9>   DW_AT_byte_size   : 1
    <6b9>   DW_AT_type        : <0x3d>
    <6bd>   DW_AT_decl_file   : 10
    <6be>   DW_AT_decl_line   : 68
    <6bf>   DW_AT_decl_column : 1
    <6bf>   DW_AT_sibling     : <0x6d0>
 <2><6c3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x2a635): GPIO_PIN_RESET
    <6c8>   DW_AT_const_value : 0
 <2><6c9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x338a0): GPIO_PIN_SET
    <6ce>   DW_AT_const_value : 1
 <2><6cf>: Abbrev Number: 0
 <1><6d0>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xc7004): GPIO_PinState
    <6d5>   DW_AT_decl_file   : 10
    <6d6>   DW_AT_decl_line   : 71
    <6d7>   DW_AT_decl_column : 2
    <6d8>   DW_AT_type        : <0x6b8>
 <1><6dc>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6dd>   DW_AT_byte_size   : 48
    <6de>   DW_AT_decl_file   : 11
    <6df>   DW_AT_decl_line   : 48
    <6e0>   DW_AT_decl_column : 9
    <6e0>   DW_AT_sibling     : <0x781>
 <2><6e4>: Abbrev Number: 2 (DW_TAG_member)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x69a31): Channel
    <6e9>   DW_AT_decl_file   : 11
    <6ea>   DW_AT_decl_line   : 50
    <6eb>   DW_AT_decl_column : 12
    <6ec>   DW_AT_type        : <0xb1>
    <6f0>   DW_AT_data_member_location: 0
 <2><6f1>: Abbrev Number: 2 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x4b8d3): Direction
    <6f6>   DW_AT_decl_file   : 11
    <6f7>   DW_AT_decl_line   : 53
    <6f8>   DW_AT_decl_column : 12
    <6f9>   DW_AT_type        : <0xb1>
    <6fd>   DW_AT_data_member_location: 4
 <2><6fe>: Abbrev Number: 2 (DW_TAG_member)
    <6ff>   DW_AT_name        : (indirect string, offset: 0xd1b2): PeriphInc
    <703>   DW_AT_decl_file   : 11
    <704>   DW_AT_decl_line   : 57
    <705>   DW_AT_decl_column : 12
    <706>   DW_AT_type        : <0xb1>
    <70a>   DW_AT_data_member_location: 8
 <2><70b>: Abbrev Number: 2 (DW_TAG_member)
    <70c>   DW_AT_name        : (indirect string, offset: 0x1fc27): MemInc
    <710>   DW_AT_decl_file   : 11
    <711>   DW_AT_decl_line   : 60
    <712>   DW_AT_decl_column : 12
    <713>   DW_AT_type        : <0xb1>
    <717>   DW_AT_data_member_location: 12
 <2><718>: Abbrev Number: 2 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0x64bc4): PeriphDataAlignment
    <71d>   DW_AT_decl_file   : 11
    <71e>   DW_AT_decl_line   : 63
    <71f>   DW_AT_decl_column : 12
    <720>   DW_AT_type        : <0xb1>
    <724>   DW_AT_data_member_location: 16
 <2><725>: Abbrev Number: 2 (DW_TAG_member)
    <726>   DW_AT_name        : (indirect string, offset: 0xb7273): MemDataAlignment
    <72a>   DW_AT_decl_file   : 11
    <72b>   DW_AT_decl_line   : 66
    <72c>   DW_AT_decl_column : 12
    <72d>   DW_AT_type        : <0xb1>
    <731>   DW_AT_data_member_location: 20
 <2><732>: Abbrev Number: 2 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0xced10): Mode
    <737>   DW_AT_decl_file   : 11
    <738>   DW_AT_decl_line   : 69
    <739>   DW_AT_decl_column : 12
    <73a>   DW_AT_type        : <0xb1>
    <73e>   DW_AT_data_member_location: 24
 <2><73f>: Abbrev Number: 2 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0xce221): Priority
    <744>   DW_AT_decl_file   : 11
    <745>   DW_AT_decl_line   : 74
    <746>   DW_AT_decl_column : 12
    <747>   DW_AT_type        : <0xb1>
    <74b>   DW_AT_data_member_location: 28
 <2><74c>: Abbrev Number: 2 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x577d9): FIFOMode
    <751>   DW_AT_decl_file   : 11
    <752>   DW_AT_decl_line   : 77
    <753>   DW_AT_decl_column : 12
    <754>   DW_AT_type        : <0xb1>
    <758>   DW_AT_data_member_location: 32
 <2><759>: Abbrev Number: 2 (DW_TAG_member)
    <75a>   DW_AT_name        : (indirect string, offset: 0x9a0e1): FIFOThreshold
    <75e>   DW_AT_decl_file   : 11
    <75f>   DW_AT_decl_line   : 82
    <760>   DW_AT_decl_column : 12
    <761>   DW_AT_type        : <0xb1>
    <765>   DW_AT_data_member_location: 36
 <2><766>: Abbrev Number: 2 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x98370): MemBurst
    <76b>   DW_AT_decl_file   : 11
    <76c>   DW_AT_decl_line   : 85
    <76d>   DW_AT_decl_column : 12
    <76e>   DW_AT_type        : <0xb1>
    <772>   DW_AT_data_member_location: 40
 <2><773>: Abbrev Number: 2 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x45c34): PeriphBurst
    <778>   DW_AT_decl_file   : 11
    <779>   DW_AT_decl_line   : 91
    <77a>   DW_AT_decl_column : 12
    <77b>   DW_AT_type        : <0xb1>
    <77f>   DW_AT_data_member_location: 44
 <2><780>: Abbrev Number: 0
 <1><781>: Abbrev Number: 4 (DW_TAG_typedef)
    <782>   DW_AT_name        : (indirect string, offset: 0x36f21): DMA_InitTypeDef
    <786>   DW_AT_decl_file   : 11
    <787>   DW_AT_decl_line   : 96
    <788>   DW_AT_decl_column : 2
    <789>   DW_AT_type        : <0x6dc>
 <1><78d>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <78e>   DW_AT_encoding    : 7	(unsigned)
    <78e>   DW_AT_byte_size   : 1
    <78e>   DW_AT_type        : <0x3d>
    <792>   DW_AT_decl_file   : 11
    <793>   DW_AT_decl_line   : 103
    <794>   DW_AT_decl_column : 1
    <794>   DW_AT_sibling     : <0x7bd>
 <2><798>: Abbrev Number: 3 (DW_TAG_enumerator)
    <799>   DW_AT_name        : (indirect string, offset: 0xccb0): HAL_DMA_STATE_RESET
    <79d>   DW_AT_const_value : 0
 <2><79e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <79f>   DW_AT_name        : (indirect string, offset: 0x382db): HAL_DMA_STATE_READY
    <7a3>   DW_AT_const_value : 1
 <2><7a4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7a5>   DW_AT_name        : (indirect string, offset: 0x8bf36): HAL_DMA_STATE_BUSY
    <7a9>   DW_AT_const_value : 2
 <2><7aa>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7ab>   DW_AT_name        : (indirect string, offset: 0xc73f6): HAL_DMA_STATE_TIMEOUT
    <7af>   DW_AT_const_value : 3
 <2><7b0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x99b7b): HAL_DMA_STATE_ERROR
    <7b5>   DW_AT_const_value : 4
 <2><7b6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b7>   DW_AT_name        : (indirect string, offset: 0x4f9bd): HAL_DMA_STATE_ABORT
    <7bb>   DW_AT_const_value : 5
 <2><7bc>: Abbrev Number: 0
 <1><7bd>: Abbrev Number: 4 (DW_TAG_typedef)
    <7be>   DW_AT_name        : (indirect string, offset: 0xb65ae): HAL_DMA_StateTypeDef
    <7c2>   DW_AT_decl_file   : 11
    <7c3>   DW_AT_decl_line   : 110
    <7c4>   DW_AT_decl_column : 2
    <7c5>   DW_AT_type        : <0x78d>
 <1><7c9>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <7ca>   DW_AT_type        : <0x7bd>
 <1><7ce>: Abbrev Number: 31 (DW_TAG_structure_type)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xac5d4): __DMA_HandleTypeDef
    <7d3>   DW_AT_byte_size   : 96
    <7d4>   DW_AT_decl_file   : 11
    <7d5>   DW_AT_decl_line   : 138
    <7d6>   DW_AT_decl_column : 16
    <7d7>   DW_AT_sibling     : <0x892>
 <2><7db>: Abbrev Number: 2 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0xc3e74): Instance
    <7e0>   DW_AT_decl_file   : 11
    <7e1>   DW_AT_decl_line   : 140
    <7e2>   DW_AT_decl_column : 31
    <7e3>   DW_AT_type        : <0x892>
    <7e7>   DW_AT_data_member_location: 0
 <2><7e8>: Abbrev Number: 2 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0xce962): Init
    <7ed>   DW_AT_decl_file   : 11
    <7ee>   DW_AT_decl_line   : 142
    <7ef>   DW_AT_decl_column : 30
    <7f0>   DW_AT_type        : <0x781>
    <7f4>   DW_AT_data_member_location: 4
 <2><7f5>: Abbrev Number: 2 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x9043e): Lock
    <7fa>   DW_AT_decl_file   : 11
    <7fb>   DW_AT_decl_line   : 144
    <7fc>   DW_AT_decl_column : 30
    <7fd>   DW_AT_type        : <0x52d>
    <801>   DW_AT_data_member_location: 52
 <2><802>: Abbrev Number: 2 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x8933f): State
    <807>   DW_AT_decl_file   : 11
    <808>   DW_AT_decl_line   : 146
    <809>   DW_AT_decl_column : 30
    <80a>   DW_AT_type        : <0x7c9>
    <80e>   DW_AT_data_member_location: 53
 <2><80f>: Abbrev Number: 2 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0xc0be9): Parent
    <814>   DW_AT_decl_file   : 11
    <815>   DW_AT_decl_line   : 148
    <816>   DW_AT_decl_column : 31
    <817>   DW_AT_type        : <0x897>
    <81b>   DW_AT_data_member_location: 56
 <2><81c>: Abbrev Number: 2 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0xc9918): XferCpltCallback
    <821>   DW_AT_decl_file   : 11
    <822>   DW_AT_decl_line   : 150
    <823>   DW_AT_decl_column : 33
    <824>   DW_AT_type        : <0x8ae>
    <828>   DW_AT_data_member_location: 60
 <2><829>: Abbrev Number: 2 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x9d886): XferHalfCpltCallback
    <82e>   DW_AT_decl_file   : 11
    <82f>   DW_AT_decl_line   : 152
    <830>   DW_AT_decl_column : 33
    <831>   DW_AT_type        : <0x8ae>
    <835>   DW_AT_data_member_location: 64
 <2><836>: Abbrev Number: 2 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x77566): XferM1CpltCallback
    <83b>   DW_AT_decl_file   : 11
    <83c>   DW_AT_decl_line   : 154
    <83d>   DW_AT_decl_column : 33
    <83e>   DW_AT_type        : <0x8ae>
    <842>   DW_AT_data_member_location: 68
 <2><843>: Abbrev Number: 2 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x61a95): XferM1HalfCpltCallback
    <848>   DW_AT_decl_file   : 11
    <849>   DW_AT_decl_line   : 156
    <84a>   DW_AT_decl_column : 33
    <84b>   DW_AT_type        : <0x8ae>
    <84f>   DW_AT_data_member_location: 72
 <2><850>: Abbrev Number: 2 (DW_TAG_member)
    <851>   DW_AT_name        : (indirect string, offset: 0x1d254): XferErrorCallback
    <855>   DW_AT_decl_file   : 11
    <856>   DW_AT_decl_line   : 158
    <857>   DW_AT_decl_column : 33
    <858>   DW_AT_type        : <0x8ae>
    <85c>   DW_AT_data_member_location: 76
 <2><85d>: Abbrev Number: 2 (DW_TAG_member)
    <85e>   DW_AT_name        : (indirect string, offset: 0xbd2dc): XferAbortCallback
    <862>   DW_AT_decl_file   : 11
    <863>   DW_AT_decl_line   : 160
    <864>   DW_AT_decl_column : 33
    <865>   DW_AT_type        : <0x8ae>
    <869>   DW_AT_data_member_location: 80
 <2><86a>: Abbrev Number: 2 (DW_TAG_member)
    <86b>   DW_AT_name        : (indirect string, offset: 0xc60be): ErrorCode
    <86f>   DW_AT_decl_file   : 11
    <870>   DW_AT_decl_line   : 162
    <871>   DW_AT_decl_column : 30
    <872>   DW_AT_type        : <0xbd>
    <876>   DW_AT_data_member_location: 84
 <2><877>: Abbrev Number: 2 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0x5ab31): StreamBaseAddress
    <87c>   DW_AT_decl_file   : 11
    <87d>   DW_AT_decl_line   : 164
    <87e>   DW_AT_decl_column : 30
    <87f>   DW_AT_type        : <0xb1>
    <883>   DW_AT_data_member_location: 88
 <2><884>: Abbrev Number: 2 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0xaa4c6): StreamIndex
    <889>   DW_AT_decl_file   : 11
    <88a>   DW_AT_decl_line   : 166
    <88b>   DW_AT_decl_column : 30
    <88c>   DW_AT_type        : <0xb1>
    <890>   DW_AT_data_member_location: 92
 <2><891>: Abbrev Number: 0
 <1><892>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <893>   DW_AT_byte_size   : 4
    <893>   DW_AT_type        : <0x129>
 <1><897>: Abbrev Number: 32 (DW_TAG_pointer_type)
    <898>   DW_AT_byte_size   : 4
 <1><899>: Abbrev Number: 15 (DW_TAG_const_type)
    <89a>   DW_AT_type        : <0x897>
 <1><89e>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <89f>   DW_AT_prototyped  : 1
    <89f>   DW_AT_sibling     : <0x8a9>
 <2><8a3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <8a4>   DW_AT_type        : <0x8a9>
 <2><8a8>: Abbrev Number: 0
 <1><8a9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8aa>   DW_AT_byte_size   : 4
    <8aa>   DW_AT_type        : <0x7ce>
 <1><8ae>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <8af>   DW_AT_byte_size   : 4
    <8af>   DW_AT_type        : <0x89e>
 <1><8b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xac5d6): DMA_HandleTypeDef
    <8b8>   DW_AT_decl_file   : 11
    <8b9>   DW_AT_decl_line   : 168
    <8ba>   DW_AT_decl_column : 2
    <8bb>   DW_AT_type        : <0x7ce>
 <1><8bf>: Abbrev Number: 13 (DW_TAG_structure_type)
    <8c0>   DW_AT_byte_size   : 24
    <8c1>   DW_AT_decl_file   : 12
    <8c2>   DW_AT_decl_line   : 46
    <8c3>   DW_AT_decl_column : 9
    <8c3>   DW_AT_sibling     : <0x916>
 <2><8c7>: Abbrev Number: 2 (DW_TAG_member)
    <8c8>   DW_AT_name        : (indirect string, offset: 0xcb5c1): Prescaler
    <8cc>   DW_AT_decl_file   : 12
    <8cd>   DW_AT_decl_line   : 48
    <8ce>   DW_AT_decl_column : 12
    <8cf>   DW_AT_type        : <0xb1>
    <8d3>   DW_AT_data_member_location: 0
 <2><8d4>: Abbrev Number: 2 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0xb826c): CounterMode
    <8d9>   DW_AT_decl_file   : 12
    <8da>   DW_AT_decl_line   : 51
    <8db>   DW_AT_decl_column : 12
    <8dc>   DW_AT_type        : <0xb1>
    <8e0>   DW_AT_data_member_location: 4
 <2><8e1>: Abbrev Number: 2 (DW_TAG_member)
    <8e2>   DW_AT_name        : (indirect string, offset: 0xd2d4a): Period
    <8e6>   DW_AT_decl_file   : 12
    <8e7>   DW_AT_decl_line   : 54
    <8e8>   DW_AT_decl_column : 12
    <8e9>   DW_AT_type        : <0xb1>
    <8ed>   DW_AT_data_member_location: 8
 <2><8ee>: Abbrev Number: 2 (DW_TAG_member)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x529ed): ClockDivision
    <8f3>   DW_AT_decl_file   : 12
    <8f4>   DW_AT_decl_line   : 58
    <8f5>   DW_AT_decl_column : 12
    <8f6>   DW_AT_type        : <0xb1>
    <8fa>   DW_AT_data_member_location: 12
 <2><8fb>: Abbrev Number: 2 (DW_TAG_member)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x8d736): RepetitionCounter
    <900>   DW_AT_decl_file   : 12
    <901>   DW_AT_decl_line   : 61
    <902>   DW_AT_decl_column : 12
    <903>   DW_AT_type        : <0xb1>
    <907>   DW_AT_data_member_location: 16
 <2><908>: Abbrev Number: 2 (DW_TAG_member)
    <909>   DW_AT_name        : (indirect string, offset: 0xbaf36): AutoReloadPreload
    <90d>   DW_AT_decl_file   : 12
    <90e>   DW_AT_decl_line   : 72
    <90f>   DW_AT_decl_column : 12
    <910>   DW_AT_type        : <0xb1>
    <914>   DW_AT_data_member_location: 20
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 4 (DW_TAG_typedef)
    <917>   DW_AT_name        : (indirect string, offset: 0x4655d): TIM_Base_InitTypeDef
    <91b>   DW_AT_decl_file   : 12
    <91c>   DW_AT_decl_line   : 74
    <91d>   DW_AT_decl_column : 3
    <91e>   DW_AT_type        : <0x8bf>
 <1><922>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <923>   DW_AT_encoding    : 7	(unsigned)
    <923>   DW_AT_byte_size   : 1
    <923>   DW_AT_type        : <0x3d>
    <927>   DW_AT_decl_file   : 12
    <927>   DW_AT_decl_line   : 291
    <929>   DW_AT_decl_column : 1
    <929>   DW_AT_sibling     : <0x94c>
 <2><92d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <92e>   DW_AT_name        : (indirect string, offset: 0x7f43f): HAL_TIM_STATE_RESET
    <932>   DW_AT_const_value : 0
 <2><933>: Abbrev Number: 3 (DW_TAG_enumerator)
    <934>   DW_AT_name        : (indirect string, offset: 0x6e2e): HAL_TIM_STATE_READY
    <938>   DW_AT_const_value : 1
 <2><939>: Abbrev Number: 3 (DW_TAG_enumerator)
    <93a>   DW_AT_name        : (indirect string, offset: 0x3383a): HAL_TIM_STATE_BUSY
    <93e>   DW_AT_const_value : 2
 <2><93f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <940>   DW_AT_name        : (indirect string, offset: 0xa957a): HAL_TIM_STATE_TIMEOUT
    <944>   DW_AT_const_value : 3
 <2><945>: Abbrev Number: 3 (DW_TAG_enumerator)
    <946>   DW_AT_name        : (indirect string, offset: 0x7d512): HAL_TIM_STATE_ERROR
    <94a>   DW_AT_const_value : 4
 <2><94b>: Abbrev Number: 0
 <1><94c>: Abbrev Number: 10 (DW_TAG_typedef)
    <94d>   DW_AT_name        : (indirect string, offset: 0x84f7e): HAL_TIM_StateTypeDef
    <951>   DW_AT_decl_file   : 12
    <952>   DW_AT_decl_line   : 297
    <954>   DW_AT_decl_column : 3
    <954>   DW_AT_type        : <0x922>
 <1><958>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <959>   DW_AT_type        : <0x94c>
 <1><95d>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <95e>   DW_AT_encoding    : 7	(unsigned)
    <95e>   DW_AT_byte_size   : 1
    <95e>   DW_AT_type        : <0x3d>
    <962>   DW_AT_decl_file   : 12
    <962>   DW_AT_decl_line   : 303
    <964>   DW_AT_decl_column : 1
    <964>   DW_AT_sibling     : <0x97b>
 <2><968>: Abbrev Number: 3 (DW_TAG_enumerator)
    <969>   DW_AT_name        : (indirect string, offset: 0x8ebf3): HAL_TIM_CHANNEL_STATE_RESET
    <96d>   DW_AT_const_value : 0
 <2><96e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <96f>   DW_AT_name        : (indirect string, offset: 0x7787d): HAL_TIM_CHANNEL_STATE_READY
    <973>   DW_AT_const_value : 1
 <2><974>: Abbrev Number: 3 (DW_TAG_enumerator)
    <975>   DW_AT_name        : (indirect string, offset: 0x61c53): HAL_TIM_CHANNEL_STATE_BUSY
    <979>   DW_AT_const_value : 2
 <2><97a>: Abbrev Number: 0
 <1><97b>: Abbrev Number: 10 (DW_TAG_typedef)
    <97c>   DW_AT_name        : (indirect string, offset: 0x2b076): HAL_TIM_ChannelStateTypeDef
    <980>   DW_AT_decl_file   : 12
    <981>   DW_AT_decl_line   : 307
    <983>   DW_AT_decl_column : 3
    <983>   DW_AT_type        : <0x95d>
 <1><987>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <988>   DW_AT_type        : <0x97b>
 <1><98c>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <98d>   DW_AT_encoding    : 7	(unsigned)
    <98d>   DW_AT_byte_size   : 1
    <98d>   DW_AT_type        : <0x3d>
    <991>   DW_AT_decl_file   : 12
    <991>   DW_AT_decl_line   : 313
    <993>   DW_AT_decl_column : 1
    <993>   DW_AT_sibling     : <0x9aa>
 <2><997>: Abbrev Number: 3 (DW_TAG_enumerator)
    <998>   DW_AT_name        : (indirect string, offset: 0x3eff): HAL_DMA_BURST_STATE_RESET
    <99c>   DW_AT_const_value : 0
 <2><99d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99e>   DW_AT_name        : (indirect string, offset: 0x7013c): HAL_DMA_BURST_STATE_READY
    <9a2>   DW_AT_const_value : 1
 <2><9a3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x44cc0): HAL_DMA_BURST_STATE_BUSY
    <9a8>   DW_AT_const_value : 2
 <2><9a9>: Abbrev Number: 0
 <1><9aa>: Abbrev Number: 10 (DW_TAG_typedef)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x1b7b8): HAL_TIM_DMABurstStateTypeDef
    <9af>   DW_AT_decl_file   : 12
    <9b0>   DW_AT_decl_line   : 317
    <9b2>   DW_AT_decl_column : 3
    <9b2>   DW_AT_type        : <0x98c>
 <1><9b6>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <9b7>   DW_AT_type        : <0x9aa>
 <1><9bb>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <9bc>   DW_AT_encoding    : 7	(unsigned)
    <9bc>   DW_AT_byte_size   : 1
    <9bc>   DW_AT_type        : <0x3d>
    <9c0>   DW_AT_decl_file   : 12
    <9c0>   DW_AT_decl_line   : 323
    <9c2>   DW_AT_decl_column : 1
    <9c2>   DW_AT_sibling     : <0x9e5>
 <2><9c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x7232f): HAL_TIM_ACTIVE_CHANNEL_1
    <9cb>   DW_AT_const_value : 1
 <2><9cc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x72348): HAL_TIM_ACTIVE_CHANNEL_2
    <9d1>   DW_AT_const_value : 2
 <2><9d2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x72361): HAL_TIM_ACTIVE_CHANNEL_3
    <9d7>   DW_AT_const_value : 4
 <2><9d8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x7237a): HAL_TIM_ACTIVE_CHANNEL_4
    <9dd>   DW_AT_const_value : 8
 <2><9de>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9df>   DW_AT_name        : (indirect string, offset: 0x53bce): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <9e3>   DW_AT_const_value : 0
 <2><9e4>: Abbrev Number: 0
 <1><9e5>: Abbrev Number: 10 (DW_TAG_typedef)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x69a23): HAL_TIM_ActiveChannel
    <9ea>   DW_AT_decl_file   : 12
    <9eb>   DW_AT_decl_line   : 329
    <9ed>   DW_AT_decl_column : 3
    <9ed>   DW_AT_type        : <0x9bb>
 <1><9f1>: Abbrev Number: 12 (DW_TAG_structure_type)
    <9f2>   DW_AT_byte_size   : 72
    <9f3>   DW_AT_decl_file   : 12
    <9f4>   DW_AT_decl_line   : 337
    <9f6>   DW_AT_decl_column : 9
    <9f6>   DW_AT_sibling     : <0xa79>
 <2><9fa>: Abbrev Number: 1 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0xc3e74): Instance
    <9ff>   DW_AT_decl_file   : 12
    <a00>   DW_AT_decl_line   : 340
    <a02>   DW_AT_decl_column : 39
    <a03>   DW_AT_type        : <0xa79>
    <a07>   DW_AT_data_member_location: 0
 <2><a08>: Abbrev Number: 1 (DW_TAG_member)
    <a09>   DW_AT_name        : (indirect string, offset: 0xce962): Init
    <a0d>   DW_AT_decl_file   : 12
    <a0e>   DW_AT_decl_line   : 341
    <a10>   DW_AT_decl_column : 38
    <a11>   DW_AT_type        : <0x916>
    <a15>   DW_AT_data_member_location: 4
 <2><a16>: Abbrev Number: 1 (DW_TAG_member)
    <a17>   DW_AT_name        : (indirect string, offset: 0x69a31): Channel
    <a1b>   DW_AT_decl_file   : 12
    <a1c>   DW_AT_decl_line   : 342
    <a1e>   DW_AT_decl_column : 38
    <a1f>   DW_AT_type        : <0x9e5>
    <a23>   DW_AT_data_member_location: 28
 <2><a24>: Abbrev Number: 1 (DW_TAG_member)
    <a25>   DW_AT_name        : (indirect string, offset: 0x79e34): hdma
    <a29>   DW_AT_decl_file   : 12
    <a2a>   DW_AT_decl_line   : 343
    <a2c>   DW_AT_decl_column : 39
    <a2d>   DW_AT_type        : <0xa7e>
    <a31>   DW_AT_data_member_location: 32
 <2><a32>: Abbrev Number: 1 (DW_TAG_member)
    <a33>   DW_AT_name        : (indirect string, offset: 0x9043e): Lock
    <a37>   DW_AT_decl_file   : 12
    <a38>   DW_AT_decl_line   : 345
    <a3a>   DW_AT_decl_column : 38
    <a3b>   DW_AT_type        : <0x52d>
    <a3f>   DW_AT_data_member_location: 60
 <2><a40>: Abbrev Number: 1 (DW_TAG_member)
    <a41>   DW_AT_name        : (indirect string, offset: 0x8933f): State
    <a45>   DW_AT_decl_file   : 12
    <a46>   DW_AT_decl_line   : 346
    <a48>   DW_AT_decl_column : 38
    <a49>   DW_AT_type        : <0x958>
    <a4d>   DW_AT_data_member_location: 61
 <2><a4e>: Abbrev Number: 1 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xcf3eb): ChannelState
    <a53>   DW_AT_decl_file   : 12
    <a54>   DW_AT_decl_line   : 347
    <a56>   DW_AT_decl_column : 38
    <a57>   DW_AT_type        : <0xaa3>
    <a5b>   DW_AT_data_member_location: 62
 <2><a5c>: Abbrev Number: 1 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xcfa1c): ChannelNState
    <a61>   DW_AT_decl_file   : 12
    <a62>   DW_AT_decl_line   : 348
    <a64>   DW_AT_decl_column : 38
    <a65>   DW_AT_type        : <0xaa3>
    <a69>   DW_AT_data_member_location: 66
 <2><a6a>: Abbrev Number: 1 (DW_TAG_member)
    <a6b>   DW_AT_name        : (indirect string, offset: 0xcef86): DMABurstState
    <a6f>   DW_AT_decl_file   : 12
    <a70>   DW_AT_decl_line   : 349
    <a72>   DW_AT_decl_column : 38
    <a73>   DW_AT_type        : <0x9b6>
    <a77>   DW_AT_data_member_location: 70
 <2><a78>: Abbrev Number: 0
 <1><a79>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a7a>   DW_AT_byte_size   : 4
    <a7a>   DW_AT_type        : <0x4d2>
 <1><a7e>: Abbrev Number: 16 (DW_TAG_array_type)
    <a7f>   DW_AT_type        : <0xa8e>
    <a83>   DW_AT_sibling     : <0xa8e>
 <2><a87>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a88>   DW_AT_type        : <0x8d>
    <a8c>   DW_AT_upper_bound : 6
 <2><a8d>: Abbrev Number: 0
 <1><a8e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a8f>   DW_AT_byte_size   : 4
    <a8f>   DW_AT_type        : <0x8b3>
 <1><a93>: Abbrev Number: 16 (DW_TAG_array_type)
    <a94>   DW_AT_type        : <0x987>
    <a98>   DW_AT_sibling     : <0xaa3>
 <2><a9c>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <a9d>   DW_AT_type        : <0x8d>
    <aa1>   DW_AT_upper_bound : 3
 <2><aa2>: Abbrev Number: 0
 <1><aa3>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <aa4>   DW_AT_type        : <0xa93>
 <1><aa8>: Abbrev Number: 10 (DW_TAG_typedef)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x45fb5): TIM_HandleTypeDef
    <aad>   DW_AT_decl_file   : 12
    <aae>   DW_AT_decl_line   : 380
    <ab0>   DW_AT_decl_column : 3
    <ab0>   DW_AT_type        : <0x9f1>
 <1><ab4>: Abbrev Number: 8 (DW_TAG_base_type)
    <ab5>   DW_AT_byte_size   : 1
    <ab6>   DW_AT_encoding    : 8	(unsigned char)
    <ab7>   DW_AT_name        : (indirect string, offset: 0x424ab): char
 <1><abb>: Abbrev Number: 15 (DW_TAG_const_type)
    <abc>   DW_AT_type        : <0xab4>
 <1><ac0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ac1>   DW_AT_byte_size   : 4
    <ac1>   DW_AT_type        : <0xabb>
 <1><ac5>: Abbrev Number: 15 (DW_TAG_const_type)
    <ac6>   DW_AT_type        : <0xac0>
 <1><aca>: Abbrev Number: 4 (DW_TAG_typedef)
    <acb>   DW_AT_name        : (indirect string, offset: 0x32dc): TaskFunction_t
    <acf>   DW_AT_decl_file   : 13
    <ad0>   DW_AT_decl_line   : 36
    <ad1>   DW_AT_decl_column : 17
    <ad2>   DW_AT_type        : <0xad6>
 <1><ad6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ad7>   DW_AT_byte_size   : 4
    <ad7>   DW_AT_type        : <0xadb>
 <1><adb>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <adc>   DW_AT_prototyped  : 1
    <adc>   DW_AT_sibling     : <0xae6>
 <2><ae0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ae1>   DW_AT_type        : <0x897>
 <2><ae5>: Abbrev Number: 0
 <1><ae6>: Abbrev Number: 4 (DW_TAG_typedef)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x177b): BaseType_t
    <aeb>   DW_AT_decl_file   : 2
    <aec>   DW_AT_decl_line   : 57
    <aed>   DW_AT_decl_column : 30
    <aee>   DW_AT_type        : <0x5e>
 <1><af2>: Abbrev Number: 4 (DW_TAG_typedef)
    <af3>   DW_AT_name        : (indirect string, offset: 0x177a): UBaseType_t
    <af7>   DW_AT_decl_file   : 2
    <af8>   DW_AT_decl_line   : 58
    <af9>   DW_AT_decl_column : 30
    <afa>   DW_AT_type        : <0x71>
 <1><afe>: Abbrev Number: 4 (DW_TAG_typedef)
    <aff>   DW_AT_name        : (indirect string, offset: 0x52b56): TaskHandle_t
    <b03>   DW_AT_decl_file   : 14
    <b04>   DW_AT_decl_line   : 87
    <b05>   DW_AT_decl_column : 38
    <b06>   DW_AT_type        : <0xb0a>
 <1><b0a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b0b>   DW_AT_byte_size   : 4
    <b0b>   DW_AT_type        : <0xb0f>
 <1><b0f>: Abbrev Number: 33 (DW_TAG_structure_type)
    <b10>   DW_AT_name        : (indirect string, offset: 0xac1f1): tskTaskControlBlock
    <b14>   DW_AT_declaration : 1
 <1><b14>: Abbrev Number: 20 (DW_TAG_variable)
    <b15>   DW_AT_name        : (indirect string, offset: 0xb874f): task1_handle
    <b19>   DW_AT_decl_file   : 1
    <b19>   DW_AT_decl_line   : 48
    <b1a>   DW_AT_decl_column : 14
    <b1b>   DW_AT_type        : <0xafe>
    <b1f>   DW_AT_external    : 1
    <b1f>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><b25>: Abbrev Number: 20 (DW_TAG_variable)
    <b26>   DW_AT_name        : (indirect string, offset: 0xb5be5): task2_handle
    <b2a>   DW_AT_decl_file   : 1
    <b2a>   DW_AT_decl_line   : 49
    <b2b>   DW_AT_decl_column : 14
    <b2c>   DW_AT_type        : <0xafe>
    <b30>   DW_AT_external    : 1
    <b30>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><b36>: Abbrev Number: 20 (DW_TAG_variable)
    <b37>   DW_AT_name        : (indirect string, offset: 0xce422): status
    <b3b>   DW_AT_decl_file   : 1
    <b3b>   DW_AT_decl_line   : 51
    <b3c>   DW_AT_decl_column : 12
    <b3d>   DW_AT_type        : <0xae6>
    <b41>   DW_AT_external    : 1
    <b41>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><b47>: Abbrev Number: 34 (DW_TAG_subprogram)
    <b48>   DW_AT_external    : 1
    <b48>   DW_AT_name        : (indirect string, offset: 0x453d6): HAL_IncTick
    <b4c>   DW_AT_decl_file   : 15
    <b4d>   DW_AT_decl_line   : 232
    <b4e>   DW_AT_decl_column : 6
    <b4f>   DW_AT_prototyped  : 1
    <b4f>   DW_AT_declaration : 1
 <1><b4f>: Abbrev Number: 25 (DW_TAG_subprogram)
    <b50>   DW_AT_external    : 1
    <b50>   DW_AT_name        : (indirect string, offset: 0x7cdcc): HAL_GPIO_Init
    <b54>   DW_AT_decl_file   : 10
    <b54>   DW_AT_decl_line   : 224
    <b55>   DW_AT_decl_column : 7
    <b56>   DW_AT_prototyped  : 1
    <b56>   DW_AT_declaration : 1
    <b56>   DW_AT_sibling     : <0xb65>
 <2><b5a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b5b>   DW_AT_type        : <0xb65>
 <2><b5f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b60>   DW_AT_type        : <0xb6a>
 <2><b64>: Abbrev Number: 0
 <1><b65>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b66>   DW_AT_byte_size   : 4
    <b66>   DW_AT_type        : <0x1cc>
 <1><b6a>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b6b>   DW_AT_byte_size   : 4
    <b6b>   DW_AT_type        : <0x6ac>
 <1><b6f>: Abbrev Number: 25 (DW_TAG_subprogram)
    <b70>   DW_AT_external    : 1
    <b70>   DW_AT_name        : (indirect string, offset: 0x244bf): HAL_GPIO_WritePin
    <b74>   DW_AT_decl_file   : 10
    <b74>   DW_AT_decl_line   : 235
    <b75>   DW_AT_decl_column : 6
    <b76>   DW_AT_prototyped  : 1
    <b76>   DW_AT_declaration : 1
    <b76>   DW_AT_sibling     : <0xb8a>
 <2><b7a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b7b>   DW_AT_type        : <0xb65>
 <2><b7f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b80>   DW_AT_type        : <0xa0>
 <2><b84>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b85>   DW_AT_type        : <0x6d0>
 <2><b89>: Abbrev Number: 0
 <1><b8a>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b8b>   DW_AT_external    : 1
    <b8b>   DW_AT_name        : (indirect string, offset: 0xad8ea): HAL_RCC_ClockConfig
    <b8f>   DW_AT_decl_file   : 9
    <b90>   DW_AT_decl_line   : 1246
    <b92>   DW_AT_decl_column : 19
    <b93>   DW_AT_prototyped  : 1
    <b93>   DW_AT_type        : <0x509>
    <b97>   DW_AT_declaration : 1
    <b97>   DW_AT_sibling     : <0xba6>
 <2><b9b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <b9c>   DW_AT_type        : <0xba6>
 <2><ba0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ba1>   DW_AT_type        : <0xb1>
 <2><ba5>: Abbrev Number: 0
 <1><ba6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ba7>   DW_AT_byte_size   : 4
    <ba7>   DW_AT_type        : <0x656>
 <1><bab>: Abbrev Number: 21 (DW_TAG_subprogram)
    <bac>   DW_AT_external    : 1
    <bac>   DW_AT_name        : (indirect string, offset: 0x8ba1f): HAL_RCC_OscConfig
    <bb0>   DW_AT_decl_file   : 9
    <bb1>   DW_AT_decl_line   : 1245
    <bb3>   DW_AT_decl_column : 19
    <bb4>   DW_AT_prototyped  : 1
    <bb4>   DW_AT_type        : <0x509>
    <bb8>   DW_AT_declaration : 1
    <bb8>   DW_AT_sibling     : <0xbc2>
 <2><bbc>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bbd>   DW_AT_type        : <0xbc2>
 <2><bc1>: Abbrev Number: 0
 <1><bc2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <bc3>   DW_AT_byte_size   : 4
    <bc3>   DW_AT_type        : <0x600>
 <1><bc7>: Abbrev Number: 35 (DW_TAG_subprogram)
    <bc8>   DW_AT_external    : 1
    <bc8>   DW_AT_name        : (indirect string, offset: 0xa2864): vTaskStartScheduler
    <bcc>   DW_AT_decl_file   : 14
    <bcd>   DW_AT_decl_line   : 1259
    <bcf>   DW_AT_decl_column : 6
    <bd0>   DW_AT_prototyped  : 1
    <bd0>   DW_AT_declaration : 1
 <1><bd0>: Abbrev Number: 21 (DW_TAG_subprogram)
    <bd1>   DW_AT_external    : 1
    <bd1>   DW_AT_name        : (indirect string, offset: 0xb9d91): xTaskCreate
    <bd5>   DW_AT_decl_file   : 14
    <bd6>   DW_AT_decl_line   : 355
    <bd8>   DW_AT_decl_column : 16
    <bd9>   DW_AT_prototyped  : 1
    <bd9>   DW_AT_type        : <0xae6>
    <bdd>   DW_AT_declaration : 1
    <bdd>   DW_AT_sibling     : <0xc00>
 <2><be1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <be2>   DW_AT_type        : <0xaca>
 <2><be6>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <be7>   DW_AT_type        : <0xac5>
 <2><beb>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bec>   DW_AT_type        : <0xac>
 <2><bf0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bf1>   DW_AT_type        : <0x899>
 <2><bf5>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bf6>   DW_AT_type        : <0xaf2>
 <2><bfa>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <bfb>   DW_AT_type        : <0xc05>
 <2><bff>: Abbrev Number: 0
 <1><c00>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c01>   DW_AT_byte_size   : 4
    <c01>   DW_AT_type        : <0xafe>
 <1><c05>: Abbrev Number: 15 (DW_TAG_const_type)
    <c06>   DW_AT_type        : <0xc00>
 <1><c0a>: Abbrev Number: 36 (DW_TAG_subprogram)
    <c0b>   DW_AT_external    : 1
    <c0b>   DW_AT_name        : (indirect string, offset: 0xbdf70): HAL_Init
    <c0f>   DW_AT_decl_file   : 15
    <c10>   DW_AT_decl_line   : 219
    <c11>   DW_AT_decl_column : 19
    <c12>   DW_AT_prototyped  : 1
    <c12>   DW_AT_type        : <0x509>
    <c16>   DW_AT_declaration : 1
 <1><c16>: Abbrev Number: 37 (DW_TAG_subprogram)
    <c17>   DW_AT_external    : 1
    <c17>   DW_AT_name        : (indirect string, offset: 0x59d2c): Error_Handler
    <c1b>   DW_AT_decl_file   : 1
    <c1c>   DW_AT_decl_line   : 351
    <c1e>   DW_AT_decl_column : 6
    <c1f>   DW_AT_prototyped  : 1
    <c1f>   DW_AT_low_pc      : 0x8000948
    <c23>   DW_AT_high_pc     : 0xc
    <c27>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c29>   DW_AT_call_all_calls: 1
    <c29>   DW_AT_sibling     : <0xc3f>
 <2><c2d>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <c2e>   DW_AT_abstract_origin: <0xe53>
    <c32>   DW_AT_low_pc      : 0x800094c
    <c36>   DW_AT_high_pc     : 0x4
    <c3a>   DW_AT_call_file   : 1
    <c3b>   DW_AT_call_line   : 355
    <c3d>   DW_AT_call_column : 3
 <2><c3e>: Abbrev Number: 0
 <1><c3f>: Abbrev Number: 39 (DW_TAG_subprogram)
    <c40>   DW_AT_external    : 1
    <c40>   DW_AT_name        : (indirect string, offset: 0xa9bde): HAL_TIM_PeriodElapsedCallback
    <c44>   DW_AT_decl_file   : 1
    <c45>   DW_AT_decl_line   : 334
    <c47>   DW_AT_decl_column : 6
    <c48>   DW_AT_prototyped  : 1
    <c48>   DW_AT_low_pc      : 0x8000924
    <c4c>   DW_AT_high_pc     : 0x24
    <c50>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c52>   DW_AT_call_all_tail_calls: 1
    <c52>   DW_AT_sibling     : <0xc66>
 <2><c56>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <c57>   DW_AT_name        : (indirect string, offset: 0x9f304): htim
    <c5b>   DW_AT_decl_file   : 1
    <c5b>   DW_AT_decl_line   : 334
    <c5d>   DW_AT_decl_column : 55
    <c5e>   DW_AT_type        : <0xc66>
    <c62>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c65>: Abbrev Number: 0
 <1><c66>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c67>   DW_AT_byte_size   : 4
    <c67>   DW_AT_type        : <0xaa8>
 <1><c6b>: Abbrev Number: 26 (DW_TAG_subprogram)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x4874c): Task2_Handler
    <c70>   DW_AT_decl_file   : 1
    <c70>   DW_AT_decl_line   : 316
    <c72>   DW_AT_decl_column : 13
    <c72>   DW_AT_prototyped  : 1
    <c72>   DW_AT_low_pc      : 0x8000914
    <c76>   DW_AT_high_pc     : 0x10
    <c7a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c7c>   DW_AT_call_all_tail_calls: 1
    <c7c>   DW_AT_sibling     : <0xc90>
 <2><c80>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <c81>   DW_AT_name        : (indirect string, offset: 0x35f75): parameters
    <c85>   DW_AT_decl_file   : 1
    <c85>   DW_AT_decl_line   : 316
    <c87>   DW_AT_decl_column : 33
    <c88>   DW_AT_type        : <0x897>
    <c8c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c8f>: Abbrev Number: 0
 <1><c90>: Abbrev Number: 26 (DW_TAG_subprogram)
    <c91>   DW_AT_name        : (indirect string, offset: 0x761d7): Task1_Handler
    <c95>   DW_AT_decl_file   : 1
    <c95>   DW_AT_decl_line   : 306
    <c97>   DW_AT_decl_column : 13
    <c97>   DW_AT_prototyped  : 1
    <c97>   DW_AT_low_pc      : 0x8000904
    <c9b>   DW_AT_high_pc     : 0x10
    <c9f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ca1>   DW_AT_call_all_tail_calls: 1
    <ca1>   DW_AT_sibling     : <0xcb5>
 <2><ca5>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x35f75): parameters
    <caa>   DW_AT_decl_file   : 1
    <caa>   DW_AT_decl_line   : 306
    <cac>   DW_AT_decl_column : 33
    <cad>   DW_AT_type        : <0x897>
    <cb1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cb4>: Abbrev Number: 0
 <1><cb5>: Abbrev Number: 40 (DW_TAG_subprogram)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x52fce): MX_GPIO_Init
    <cba>   DW_AT_decl_file   : 1
    <cbb>   DW_AT_decl_line   : 168
    <cbc>   DW_AT_decl_column : 13
    <cbd>   DW_AT_prototyped  : 1
    <cbd>   DW_AT_low_pc      : 0x8000648
    <cc1>   DW_AT_high_pc     : 0x2bc
    <cc5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc7>   DW_AT_call_all_tail_calls: 1
    <cc7>   DW_AT_sibling     : <0xd7e>
 <2><ccb>: Abbrev Number: 9 (DW_TAG_variable)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x12f0c): GPIO_InitStruct
    <cd0>   DW_AT_decl_file   : 1
    <cd0>   DW_AT_decl_line   : 170
    <cd1>   DW_AT_decl_column : 20
    <cd2>   DW_AT_type        : <0x6ac>
    <cd6>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cd9>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <cda>   DW_AT_low_pc      : 0x800065e
    <cde>   DW_AT_high_pc     : 0x1c
    <ce2>   DW_AT_sibling     : <0xcf5>
 <3><ce6>: Abbrev Number: 9 (DW_TAG_variable)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <ceb>   DW_AT_decl_file   : 1
    <ceb>   DW_AT_decl_line   : 175
    <cec>   DW_AT_decl_column : 3
    <ced>   DW_AT_type        : <0xbd>
    <cf1>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><cf4>: Abbrev Number: 0
 <2><cf5>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <cf6>   DW_AT_low_pc      : 0x800067a
    <cfa>   DW_AT_high_pc     : 0x1c
    <cfe>   DW_AT_sibling     : <0xd11>
 <3><d02>: Abbrev Number: 9 (DW_TAG_variable)
    <d03>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <d07>   DW_AT_decl_file   : 1
    <d07>   DW_AT_decl_line   : 176
    <d08>   DW_AT_decl_column : 3
    <d09>   DW_AT_type        : <0xbd>
    <d0d>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><d10>: Abbrev Number: 0
 <2><d11>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <d12>   DW_AT_low_pc      : 0x8000696
    <d16>   DW_AT_high_pc     : 0x1c
    <d1a>   DW_AT_sibling     : <0xd2d>
 <3><d1e>: Abbrev Number: 9 (DW_TAG_variable)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <d23>   DW_AT_decl_file   : 1
    <d23>   DW_AT_decl_line   : 177
    <d24>   DW_AT_decl_column : 3
    <d25>   DW_AT_type        : <0xbd>
    <d29>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><d2c>: Abbrev Number: 0
 <2><d2d>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <d2e>   DW_AT_low_pc      : 0x80006b2
    <d32>   DW_AT_high_pc     : 0x1c
    <d36>   DW_AT_sibling     : <0xd49>
 <3><d3a>: Abbrev Number: 9 (DW_TAG_variable)
    <d3b>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <d3f>   DW_AT_decl_file   : 1
    <d3f>   DW_AT_decl_line   : 178
    <d40>   DW_AT_decl_column : 3
    <d41>   DW_AT_type        : <0xbd>
    <d45>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><d48>: Abbrev Number: 0
 <2><d49>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <d4a>   DW_AT_low_pc      : 0x80006ce
    <d4e>   DW_AT_high_pc     : 0x1c
    <d52>   DW_AT_sibling     : <0xd65>
 <3><d56>: Abbrev Number: 9 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <d5b>   DW_AT_decl_file   : 1
    <d5b>   DW_AT_decl_line   : 179
    <d5c>   DW_AT_decl_column : 3
    <d5d>   DW_AT_type        : <0xbd>
    <d61>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><d64>: Abbrev Number: 0
 <2><d65>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <d66>   DW_AT_low_pc      : 0x80006ea
    <d6a>   DW_AT_high_pc     : 0x1c
 <3><d6e>: Abbrev Number: 9 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <d73>   DW_AT_decl_file   : 1
    <d73>   DW_AT_decl_line   : 180
    <d74>   DW_AT_decl_column : 3
    <d75>   DW_AT_type        : <0xbd>
    <d79>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <3><d7c>: Abbrev Number: 0
 <2><d7d>: Abbrev Number: 0
 <1><d7e>: Abbrev Number: 41 (DW_TAG_subprogram)
    <d7f>   DW_AT_external    : 1
    <d7f>   DW_AT_name        : (indirect string, offset: 0x8be4e): SystemClock_Config
    <d83>   DW_AT_decl_file   : 1
    <d84>   DW_AT_decl_line   : 121
    <d85>   DW_AT_decl_column : 6
    <d86>   DW_AT_prototyped  : 1
    <d86>   DW_AT_low_pc      : 0x8000574
    <d8a>   DW_AT_high_pc     : 0xd4
    <d8e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d90>   DW_AT_call_all_tail_calls: 1
    <d90>   DW_AT_sibling     : <0xde8>
 <2><d94>: Abbrev Number: 9 (DW_TAG_variable)
    <d95>   DW_AT_name        : (indirect string, offset: 0x2cc4d): RCC_OscInitStruct
    <d99>   DW_AT_decl_file   : 1
    <d99>   DW_AT_decl_line   : 123
    <d9a>   DW_AT_decl_column : 22
    <d9b>   DW_AT_type        : <0x600>
    <d9f>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><da2>: Abbrev Number: 9 (DW_TAG_variable)
    <da3>   DW_AT_name        : (indirect string, offset: 0x4ced1): RCC_ClkInitStruct
    <da7>   DW_AT_decl_file   : 1
    <da7>   DW_AT_decl_line   : 124
    <da8>   DW_AT_decl_column : 22
    <da9>   DW_AT_type        : <0x656>
    <dad>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><db1>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <db2>   DW_AT_low_pc      : 0x8000598
    <db6>   DW_AT_high_pc     : 0x1c
    <dba>   DW_AT_sibling     : <0xdce>
 <3><dbe>: Abbrev Number: 9 (DW_TAG_variable)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <dc3>   DW_AT_decl_file   : 1
    <dc3>   DW_AT_decl_line   : 128
    <dc4>   DW_AT_decl_column : 3
    <dc5>   DW_AT_type        : <0xbd>
    <dc9>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><dcd>: Abbrev Number: 0
 <2><dce>: Abbrev Number: 27 (DW_TAG_lexical_block)
    <dcf>   DW_AT_low_pc      : 0x80005b4
    <dd3>   DW_AT_high_pc     : 0x1c
 <3><dd7>: Abbrev Number: 9 (DW_TAG_variable)
    <dd8>   DW_AT_name        : (indirect string, offset: 0x17cc): tmpreg
    <ddc>   DW_AT_decl_file   : 1
    <ddc>   DW_AT_decl_line   : 129
    <ddd>   DW_AT_decl_column : 3
    <dde>   DW_AT_type        : <0xbd>
    <de2>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><de6>: Abbrev Number: 0
 <2><de7>: Abbrev Number: 0
 <1><de8>: Abbrev Number: 42 (DW_TAG_subprogram)
    <de9>   DW_AT_external    : 1
    <de9>   DW_AT_name        : (indirect string, offset: 0x13999): main
    <ded>   DW_AT_decl_file   : 1
    <dee>   DW_AT_decl_line   : 71
    <def>   DW_AT_decl_column : 5
    <df0>   DW_AT_prototyped  : 1
    <df0>   DW_AT_type        : <0x86>
    <df4>   DW_AT_low_pc      : 0x80004c0
    <df8>   DW_AT_high_pc     : 0xb4
    <dfc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dfe>   DW_AT_call_all_tail_calls: 1
    <dfe>   DW_AT_sibling     : <0xe39>
 <2><e02>: Abbrev Number: 43 (DW_TAG_inlined_subroutine)
    <e03>   DW_AT_abstract_origin: <0xe39>
    <e07>   DW_AT_low_pc      : 0x80004f4
    <e0b>   DW_AT_high_pc     : 0x14
    <e0f>   DW_AT_call_file   : 1
    <e10>   DW_AT_call_line   : 98
    <e11>   DW_AT_call_column : 1
    <e12>   DW_AT_sibling     : <0xe1f>
 <3><e16>: Abbrev Number: 28 (DW_TAG_variable)
    <e17>   DW_AT_abstract_origin: <0xe46>
    <e1b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><e1e>: Abbrev Number: 0
 <2><e1f>: Abbrev Number: 44 (DW_TAG_inlined_subroutine)
    <e20>   DW_AT_abstract_origin: <0xe39>
    <e24>   DW_AT_low_pc      : 0x800052e
    <e28>   DW_AT_high_pc     : 0x14
    <e2c>   DW_AT_call_file   : 1
    <e2d>   DW_AT_call_line   : 101
    <e2e>   DW_AT_call_column : 1
 <3><e2f>: Abbrev Number: 28 (DW_TAG_variable)
    <e30>   DW_AT_abstract_origin: <0xe46>
    <e34>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><e37>: Abbrev Number: 0
 <2><e38>: Abbrev Number: 0
 <1><e39>: Abbrev Number: 45 (DW_TAG_subprogram)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xad591): vPortRaiseBASEPRI
    <e3e>   DW_AT_decl_file   : 2
    <e3f>   DW_AT_decl_line   : 194
    <e40>   DW_AT_decl_column : 34
    <e41>   DW_AT_prototyped  : 1
    <e41>   DW_AT_inline      : 3	(declared as inline and inlined)
    <e42>   DW_AT_sibling     : <0xe53>
 <2><e46>: Abbrev Number: 46 (DW_TAG_variable)
    <e47>   DW_AT_name        : (indirect string, offset: 0xb7950): ulNewBASEPRI
    <e4b>   DW_AT_decl_file   : 2
    <e4c>   DW_AT_decl_line   : 196
    <e4d>   DW_AT_decl_column : 18
    <e4e>   DW_AT_type        : <0xb1>
 <2><e52>: Abbrev Number: 0
 <1><e53>: Abbrev Number: 47 (DW_TAG_subprogram)
    <e54>   DW_AT_name        : (indirect string, offset: 0x70350): __disable_irq
    <e58>   DW_AT_decl_file   : 3
    <e59>   DW_AT_decl_line   : 960
    <e5b>   DW_AT_decl_column : 27
    <e5c>   DW_AT_prototyped  : 1
    <e5c>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><e5d>: Abbrev Number: 0
  Compilation Unit @ offset 0xe5e:
   Length:        0x265 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x309
   Pointer Size:  4
 <0><e6a>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <e6b>   DW_AT_producer    : (indirect string, offset: 0x3589c): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e6f>   DW_AT_language    : 29	(C11)
    <e70>   DW_AT_name        : (indirect string, offset: 0xcb2c5): ../Core/Src/stm32f4xx_hal_msp.c
    <e74>   DW_AT_comp_dir    : (indirect string, offset: 0xc7fe9): C:/Users/Lenovo/STM32CubeIDE/RTOS_Workspace/001_Tasks/Debug
    <e78>   DW_AT_ranges      : 0x46
    <e7c>   DW_AT_low_pc      : 0
    <e80>   DW_AT_stmt_list   : 0xc05
    <e84>   DW_AT_macros      : 0x2017a
 <1><e88>: Abbrev Number: 2 (DW_TAG_base_type)
    <e89>   DW_AT_byte_size   : 1
    <e8a>   DW_AT_encoding    : 6	(signed char)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x65a47): signed char
 <1><e8f>: Abbrev Number: 2 (DW_TAG_base_type)
    <e90>   DW_AT_byte_size   : 1
    <e91>   DW_AT_encoding    : 8	(unsigned char)
    <e92>   DW_AT_name        : (indirect string, offset: 0xc3a5a): unsigned char
 <1><e96>: Abbrev Number: 2 (DW_TAG_base_type)
    <e97>   DW_AT_byte_size   : 2
    <e98>   DW_AT_encoding    : 5	(signed)
    <e99>   DW_AT_name        : (indirect string, offset: 0x96f0a): short int
 <1><e9d>: Abbrev Number: 2 (DW_TAG_base_type)
    <e9e>   DW_AT_byte_size   : 2
    <e9f>   DW_AT_encoding    : 7	(unsigned)
    <ea0>   DW_AT_name        : (indirect string, offset: 0xc2272): short unsigned int
 <1><ea4>: Abbrev Number: 2 (DW_TAG_base_type)
    <ea5>   DW_AT_byte_size   : 4
    <ea6>   DW_AT_encoding    : 5	(signed)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x10ace): long int
 <1><eab>: Abbrev Number: 4 (DW_TAG_typedef)
    <eac>   DW_AT_name        : (indirect string, offset: 0x811de): __uint32_t
    <eb0>   DW_AT_decl_file   : 2
    <eb1>   DW_AT_decl_line   : 79
    <eb2>   DW_AT_decl_column : 25
    <eb3>   DW_AT_type        : <0xeb7>
 <1><eb7>: Abbrev Number: 2 (DW_TAG_base_type)
    <eb8>   DW_AT_byte_size   : 4
    <eb9>   DW_AT_encoding    : 7	(unsigned)
    <eba>   DW_AT_name        : (indirect string, offset: 0x4dd7d): long unsigned int
 <1><ebe>: Abbrev Number: 2 (DW_TAG_base_type)
    <ebf>   DW_AT_byte_size   : 8
    <ec0>   DW_AT_encoding    : 5	(signed)
    <ec1>   DW_AT_name        : (indirect string, offset: 0x5caa8): long long int
 <1><ec5>: Abbrev Number: 2 (DW_TAG_base_type)
    <ec6>   DW_AT_byte_size   : 8
    <ec7>   DW_AT_encoding    : 7	(unsigned)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x2ab50): long long unsigned int
 <1><ecc>: Abbrev Number: 7 (DW_TAG_base_type)
    <ecd>   DW_AT_byte_size   : 4
    <ece>   DW_AT_encoding    : 5	(signed)
    <ecf>   DW_AT_name        : int
 <1><ed3>: Abbrev Number: 2 (DW_TAG_base_type)
    <ed4>   DW_AT_byte_size   : 4
    <ed5>   DW_AT_encoding    : 7	(unsigned)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x1017b): unsigned int
 <1><eda>: Abbrev Number: 4 (DW_TAG_typedef)
    <edb>   DW_AT_name        : (indirect string, offset: 0xaa4e8): uint32_t
    <edf>   DW_AT_decl_file   : 3
    <ee0>   DW_AT_decl_line   : 48
    <ee1>   DW_AT_decl_column : 20
    <ee2>   DW_AT_type        : <0xeab>
 <1><ee6>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ee7>   DW_AT_type        : <0xeda>
 <1><eeb>: Abbrev Number: 9 (DW_TAG_array_type)
    <eec>   DW_AT_type        : <0xeda>
    <ef0>   DW_AT_sibling     : <0xefb>
 <2><ef4>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <ef5>   DW_AT_type        : <0xed3>
    <ef9>   DW_AT_upper_bound : 1
 <2><efa>: Abbrev Number: 0
 <1><efb>: Abbrev Number: 11 (DW_TAG_structure_type)
    <efc>   DW_AT_byte_size   : 136
    <efd>   DW_AT_decl_file   : 4
    <efe>   DW_AT_decl_line   : 596
    <f00>   DW_AT_decl_column : 9
    <f01>   DW_AT_sibling     : <0x106d>
 <2><f05>: Abbrev Number: 3 (DW_TAG_member)
    <f06>   DW_AT_name        : CR
    <f09>   DW_AT_decl_file   : 4
    <f09>   DW_AT_decl_line   : 598
    <f0b>   DW_AT_decl_column : 17
    <f0b>   DW_AT_type        : <0xee6>
    <f0f>   DW_AT_data_member_location: 0
 <2><f10>: Abbrev Number: 1 (DW_TAG_member)
    <f11>   DW_AT_name        : (indirect string, offset: 0x8da35): PLLCFGR
    <f15>   DW_AT_decl_file   : 4
    <f15>   DW_AT_decl_line   : 599
    <f17>   DW_AT_decl_column : 17
    <f17>   DW_AT_type        : <0xee6>
    <f1b>   DW_AT_data_member_location: 4
 <2><f1c>: Abbrev Number: 1 (DW_TAG_member)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x8da38): CFGR
    <f21>   DW_AT_decl_file   : 4
    <f21>   DW_AT_decl_line   : 600
    <f23>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0xee6>
    <f27>   DW_AT_data_member_location: 8
 <2><f28>: Abbrev Number: 3 (DW_TAG_member)
    <f29>   DW_AT_name        : CIR
    <f2d>   DW_AT_decl_file   : 4
    <f2d>   DW_AT_decl_line   : 601
    <f2f>   DW_AT_decl_column : 17
    <f2f>   DW_AT_type        : <0xee6>
    <f33>   DW_AT_data_member_location: 12
 <2><f34>: Abbrev Number: 1 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0xa13e8): AHB1RSTR
    <f39>   DW_AT_decl_file   : 4
    <f39>   DW_AT_decl_line   : 602
    <f3b>   DW_AT_decl_column : 17
    <f3b>   DW_AT_type        : <0xee6>
    <f3f>   DW_AT_data_member_location: 16
 <2><f40>: Abbrev Number: 1 (DW_TAG_member)
    <f41>   DW_AT_name        : (indirect string, offset: 0x169d5): AHB2RSTR
    <f45>   DW_AT_decl_file   : 4
    <f45>   DW_AT_decl_line   : 603
    <f47>   DW_AT_decl_column : 17
    <f47>   DW_AT_type        : <0xee6>
    <f4b>   DW_AT_data_member_location: 20
 <2><f4c>: Abbrev Number: 1 (DW_TAG_member)
    <f4d>   DW_AT_name        : (indirect string, offset: 0x432fb): AHB3RSTR
    <f51>   DW_AT_decl_file   : 4
    <f51>   DW_AT_decl_line   : 604
    <f53>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xee6>
    <f57>   DW_AT_data_member_location: 24
 <2><f58>: Abbrev Number: 1 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0xbf1b3): RESERVED0
    <f5d>   DW_AT_decl_file   : 4
    <f5d>   DW_AT_decl_line   : 605
    <f5f>   DW_AT_decl_column : 17
    <f5f>   DW_AT_type        : <0xeda>
    <f63>   DW_AT_data_member_location: 28
 <2><f64>: Abbrev Number: 1 (DW_TAG_member)
    <f65>   DW_AT_name        : (indirect string, offset: 0x1654e): APB1RSTR
    <f69>   DW_AT_decl_file   : 4
    <f69>   DW_AT_decl_line   : 606
    <f6b>   DW_AT_decl_column : 17
    <f6b>   DW_AT_type        : <0xee6>
    <f6f>   DW_AT_data_member_location: 32
 <2><f70>: Abbrev Number: 1 (DW_TAG_member)
    <f71>   DW_AT_name        : (indirect string, offset: 0x57e52): APB2RSTR
    <f75>   DW_AT_decl_file   : 4
    <f75>   DW_AT_decl_line   : 607
    <f77>   DW_AT_decl_column : 17
    <f77>   DW_AT_type        : <0xee6>
    <f7b>   DW_AT_data_member_location: 36
 <2><f7c>: Abbrev Number: 1 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0xbf1bd): RESERVED1
    <f81>   DW_AT_decl_file   : 4
    <f81>   DW_AT_decl_line   : 608
    <f83>   DW_AT_decl_column : 17
    <f83>   DW_AT_type        : <0xeeb>
    <f87>   DW_AT_data_member_location: 40
 <2><f88>: Abbrev Number: 1 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0x10110): AHB1ENR
    <f8d>   DW_AT_decl_file   : 4
    <f8d>   DW_AT_decl_line   : 609
    <f8f>   DW_AT_decl_column : 17
    <f8f>   DW_AT_type        : <0xee6>
    <f93>   DW_AT_data_member_location: 48
 <2><f94>: Abbrev Number: 1 (DW_TAG_member)
    <f95>   DW_AT_name        : (indirect string, offset: 0x36475): AHB2ENR
    <f99>   DW_AT_decl_file   : 4
    <f99>   DW_AT_decl_line   : 610
    <f9b>   DW_AT_decl_column : 17
    <f9b>   DW_AT_type        : <0xee6>
    <f9f>   DW_AT_data_member_location: 52
 <2><fa0>: Abbrev Number: 1 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x5b04e): AHB3ENR
    <fa5>   DW_AT_decl_file   : 4
    <fa5>   DW_AT_decl_line   : 611
    <fa7>   DW_AT_decl_column : 17
    <fa7>   DW_AT_type        : <0xee6>
    <fab>   DW_AT_data_member_location: 56
 <2><fac>: Abbrev Number: 1 (DW_TAG_member)
    <fad>   DW_AT_name        : (indirect string, offset: 0xbf1c7): RESERVED2
    <fb1>   DW_AT_decl_file   : 4
    <fb1>   DW_AT_decl_line   : 612
    <fb3>   DW_AT_decl_column : 17
    <fb3>   DW_AT_type        : <0xeda>
    <fb7>   DW_AT_data_member_location: 60
 <2><fb8>: Abbrev Number: 1 (DW_TAG_member)
    <fb9>   DW_AT_name        : (indirect string, offset: 0x74846): APB1ENR
    <fbd>   DW_AT_decl_file   : 4
    <fbd>   DW_AT_decl_line   : 613
    <fbf>   DW_AT_decl_column : 17
    <fbf>   DW_AT_type        : <0xee6>
    <fc3>   DW_AT_data_member_location: 64
 <2><fc4>: Abbrev Number: 1 (DW_TAG_member)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x17b6d): APB2ENR
    <fc9>   DW_AT_decl_file   : 4
    <fc9>   DW_AT_decl_line   : 614
    <fcb>   DW_AT_decl_column : 17
    <fcb>   DW_AT_type        : <0xee6>
    <fcf>   DW_AT_data_member_location: 68
 <2><fd0>: Abbrev Number: 1 (DW_TAG_member)
    <fd1>   DW_AT_name        : (indirect string, offset: 0xbf1d1): RESERVED3
    <fd5>   DW_AT_decl_file   : 4
    <fd5>   DW_AT_decl_line   : 615
    <fd7>   DW_AT_decl_column : 17
    <fd7>   DW_AT_type        : <0xeeb>
    <fdb>   DW_AT_data_member_location: 72
 <2><fdc>: Abbrev Number: 1 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0xa53ab): AHB1LPENR
    <fe1>   DW_AT_decl_file   : 4
    <fe1>   DW_AT_decl_line   : 616
    <fe3>   DW_AT_decl_column : 17
    <fe3>   DW_AT_type        : <0xee6>
    <fe7>   DW_AT_data_member_location: 80
 <2><fe8>: Abbrev Number: 1 (DW_TAG_member)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x2dee1): AHB2LPENR
    <fed>   DW_AT_decl_file   : 4
    <fed>   DW_AT_decl_line   : 617
    <fef>   DW_AT_decl_column : 17
    <fef>   DW_AT_type        : <0xee6>
    <ff3>   DW_AT_data_member_location: 84
 <2><ff4>: Abbrev Number: 1 (DW_TAG_member)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x88c9c): AHB3LPENR
    <ff9>   DW_AT_decl_file   : 4
    <ff9>   DW_AT_decl_line   : 618
    <ffb>   DW_AT_decl_column : 17
    <ffb>   DW_AT_type        : <0xee6>
    <fff>   DW_AT_data_member_location: 88
 <2><1000>: Abbrev Number: 1 (DW_TAG_member)
    <1001>   DW_AT_name        : (indirect string, offset: 0xbf1db): RESERVED4
    <1005>   DW_AT_decl_file   : 4
    <1005>   DW_AT_decl_line   : 619
    <1007>   DW_AT_decl_column : 17
    <1007>   DW_AT_type        : <0xeda>
    <100b>   DW_AT_data_member_location: 92
 <2><100c>: Abbrev Number: 1 (DW_TAG_member)
    <100d>   DW_AT_name        : (indirect string, offset: 0xaa12b): APB1LPENR
    <1011>   DW_AT_decl_file   : 4
    <1011>   DW_AT_decl_line   : 620
    <1013>   DW_AT_decl_column : 17
    <1013>   DW_AT_type        : <0xee6>
    <1017>   DW_AT_data_member_location: 96
 <2><1018>: Abbrev Number: 1 (DW_TAG_member)
    <1019>   DW_AT_name        : (indirect string, offset: 0x33de9): APB2LPENR
    <101d>   DW_AT_decl_file   : 4
    <101d>   DW_AT_decl_line   : 621
    <101f>   DW_AT_decl_column : 17
    <101f>   DW_AT_type        : <0xee6>
    <1023>   DW_AT_data_member_location: 100
 <2><1024>: Abbrev Number: 1 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0xbf1e5): RESERVED5
    <1029>   DW_AT_decl_file   : 4
    <1029>   DW_AT_decl_line   : 622
    <102b>   DW_AT_decl_column : 17
    <102b>   DW_AT_type        : <0xeeb>
    <102f>   DW_AT_data_member_location: 104
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0x1c19a): BDCR
    <1035>   DW_AT_decl_file   : 4
    <1035>   DW_AT_decl_line   : 623
    <1037>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0xee6>
    <103b>   DW_AT_data_member_location: 112
 <2><103c>: Abbrev Number: 3 (DW_TAG_member)
    <103d>   DW_AT_name        : CSR
    <1041>   DW_AT_decl_file   : 4
    <1041>   DW_AT_decl_line   : 624
    <1043>   DW_AT_decl_column : 17
    <1043>   DW_AT_type        : <0xee6>
    <1047>   DW_AT_data_member_location: 116
 <2><1048>: Abbrev Number: 1 (DW_TAG_member)
    <1049>   DW_AT_name        : (indirect string, offset: 0x78ffc): RESERVED6
    <104d>   DW_AT_decl_file   : 4
    <104d>   DW_AT_decl_line   : 625
    <104f>   DW_AT_decl_column : 17
    <104f>   DW_AT_type        : <0xeeb>
    <1053>   DW_AT_data_member_location: 120
 <2><1054>: Abbrev Number: 1 (DW_TAG_member)
    <1055>   DW_AT_name        : (indirect string, offset: 0x6bafe): SSCGR
    <1059>   DW_AT_decl_file   : 4
    <1059>   DW_AT_decl_line   : 626
    <105b>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0xee6>
    <105f>   DW_AT_data_member_location: 128
 <2><1060>: Abbrev Number: 1 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0x43c94): PLLI2SCFGR
    <1065>   DW_AT_decl_file   : 4
    <1065>   DW_AT_decl_line   : 627
    <1067>   DW_AT_decl_column : 17
    <1067>   DW_AT_type        : <0xee6>
    <106b>   DW_AT_data_member_location: 132
 <2><106c>: Abbrev Number: 0
 <1><106d>: Abbrev Number: 12 (DW_TAG_typedef)
    <106e>   DW_AT_name        : (indirect string, offset: 0x5df6a): RCC_TypeDef
    <1072>   DW_AT_decl_file   : 4
    <1073>   DW_AT_decl_line   : 628
    <1075>   DW_AT_decl_column : 3
    <1076>   DW_AT_type        : <0xefb>
 <1><107a>: Abbrev Number: 2 (DW_TAG_base_type)
    <107b>   DW_AT_byte_size   : 8
    <107c>   DW_AT_encoding    : 4	(float)
    <107d>   DW_AT_name        : (indirect string, offset: 0x1237e): long double
 <1><1081>: Abbrev Number: 13 (DW_TAG_subprogram)
    <1082>   DW_AT_external    : 1
    <1082>   DW_AT_name        : (indirect string, offset: 0xcb2b9): HAL_MspInit
    <1086>   DW_AT_decl_file   : 1
    <1087>   DW_AT_decl_line   : 64
    <1088>   DW_AT_decl_column : 6
    <1089>   DW_AT_prototyped  : 1
    <1089>   DW_AT_low_pc      : 0x8000954
    <108d>   DW_AT_high_pc     : 0x50
    <1091>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1093>   DW_AT_call_all_calls: 1
